{
  "text": {
    "id": "ee17e35f-2fad-4a63-b0f6-57ce91138388",
    "cefr_level": "B1",
    "text_id": "text_001",
    "text_translated": "An asteroid is a small space rock that travels around the Sun. NASA is now working to record some of the smaller ones. These asteroids measure 140 metres wide or more. Scientists estimate there are about 25,000 asteroids of this size. So far, only about 8,000 have been recorded. That leaves around 17,000 not yet recorded. In 2013, a 19-metre asteroid exploded above the Russian city of Chelyabinsk and injured 1,200 people. This shows that even a small object can be dangerous. These middle-sized asteroids would be a serious danger if they enter Earth's orbit.",
    "version": 11,
    "created_at": "2025-08-31 23:27:59.793096",
    "updated_at": "2025-08-31 23:27:59.793122",
    "metrics_meaningbert": null,
    "metrics_cefr_compliance": null
  },
  "feedback": {
    "id": "6e691fd0-7ffe-420a-a227-595dccf5d834",
    "approval": "FAIL",
    "grade": 6,
    "feedback": "FAIL: CEFR Compliance. The classifier labeled the text as ‘A2’, which means it is too simple for a B1 level. Most sentences are short and independent, for example: “So far, only about 8,000 have been recorded. That leaves around 17,000 not yet recorded.” Such simple structures keep the overall level in A2. To raise the level to B1, combine ideas with connectors (for example: “So far, only about 8,000 have been recorded, leaving around 17,000 unaccounted for.”), use more varied sentence structures (such as relative clauses: “Asteroids, which are small space rocks orbiting the Sun, can measure 140 metres or more.”), and include B1-level linking words like however, therefore, and although. This will make the text more complex and fluent while preserving its accuracy.",
    "metrics": {
      "cefr_compliance": "A2",
      "bertscore": 0.9437,
      "meaningbert": 0.8561
    },
    "created_at": "2025-08-31 23:28:14.560589"
  },
  "attempt_number": 11,
  "best_attempt": {
    "id": "94f08471-9a97-4d5d-b02e-63cca1255c62",
    "cefr_level": "B1",
    "text_id": "text_001",
    "text_translated": "NASA is now working to record some of the smaller asteroids. An asteroid is a space rock that travels around the Sun. These asteroids are at least 140 metres wide. Scientists estimate there are about 25,000 of this size. They have recorded around 8,000 so far, so about 17,000 are still not found. In 2013, a 19-metre asteroid exploded above the city of Chelyabinsk in Russia and injured 1,200 people. Asteroids of this size would be a serious danger if they enter Earth's orbit.",
    "version": 4,
    "created_at": "2025-08-31 23:20:56.133165",
    "updated_at": "2025-08-31 23:20:56.133221",
    "metrics_meaningbert": 0.886,
    "metrics_cefr_compliance": "B2"
  }
}