{
  "text": {
    "id": "a074593d-38d7-47b8-b2e3-ce99c34da178",
    "cefr_level": "A2",
    "text_id": "text_001",
    "text_translated": "These are special dangerous rocks. We call them 'Potentially Hazardous Asteroids'. They pass less than 7.5 million kilometres from Earth's path.\nNASA made a map of 1,400 of these rocks. NASA thinks they will not be a danger for Earth. This is for the next 100 years.\nNASA has tools now. They can watch these rocks. They can guess if a rock might hit Earth.\nIf a rock might hit, NASA has two plans. These plans can protect Earth.",
    "version": 11,
    "created_at": "2025-09-01 17:59:07.963176",
    "updated_at": "2025-09-01 17:59:07.963177",
    "metrics_meaningbert": null,
    "metrics_cefr_compliance": null
  },
  "feedback": {
    "id": "2b6c220b-802a-4b8a-9d97-0ca6dd5fb25c",
    "approval": "FAIL",
    "grade": 4,
    "feedback": "FAIL: Meaning Preservation Failure. The MeaningBERT score of 0.7074 is below the required 0.75. The core meaning of the original text has been subtly altered. The original defines 'Potentially Hazardous Asteroids' by their proximity ('are rocks close enough to pass within...'). Your version describes them as 'special dangerous rocks' and then names them, weakening the definitional aspect. The original states 'none of which are expected to be a threat', conveying a scientific expectation. Your version 'NASA thinks they will not be a danger' introduces a subjective 'thinks' which reduces the certainty. Furthermore, 'two defence solutions could be launched' in the original implies active intervention, which is lost in your 'NASA has two plans. These plans can protect Earth.' which only states the existence of plans. Suggestion: Rephrase the definition to clearly state what PHAs are based on their proximity. Ensure the certainty of NASA's assessment is maintained. Rephrase the defence aspect to include the concept of launching or activating solutions.",
    "metrics": {
      "cefr_compliance": "A2",
      "bertscore": 0.9053,
      "meaningbert": 0.7074
    },
    "created_at": "2025-09-01 17:59:32.447208"
  },
  "attempt_number": 11,
  "best_attempt": {
    "id": "dfa261cc-e641-4a5f-9952-0cba3c1b2050",
    "cefr_level": "A2",
    "text_id": "text_001",
    "text_translated": "Some rocks in space can be dangerous. We call them 'Potentially Hazardous Asteroids'. They come close to Earth. They pass less than 7.5 million kilometres from Earth's path.\nNASA made a map of 1,400 of these rocks. NASA thinks they will not be a danger for Earth in the next 100 years.\nNASA has tools now. They can watch these rocks. They can guess if a rock might hit Earth.\nIf a rock might hit, NASA could send two things. These things can protect Earth.",
    "version": 7,
    "created_at": "2025-09-01 17:56:57.202875",
    "updated_at": "2025-09-01 17:56:57.202876",
    "metrics_meaningbert": 0.7222,
    "metrics_cefr_compliance": "A2"
  }
}