{
  "text": {
    "id": "8fc75710-c238-4f8f-bfb6-612bb450d287",
    "cefr_level": "A2",
    "text_id": "text_001",
    "text_translated": "DART is a test to change a small space rock.  \nThe test will hit Didymoon.  \nDidymoon is the small moon of Didymos.  \nDidymoon is about 150 metres wide.  \nDidymos is about 800 metres wide.  \nThe hit will knock Didymoon out of its orbit.  \nScientists hope Earth telescopes can see the change.",
    "version": 11,
    "created_at": "2025-09-01 17:20:00.709014",
    "updated_at": "2025-09-01 17:20:00.709014",
    "metrics_meaningbert": null,
    "metrics_cefr_compliance": null
  },
  "feedback": {
    "id": "8f734bf4-c6ad-47d8-8204-4a056a050474",
    "approval": "FAIL",
    "grade": 2,
    "feedback": "FAIL: Meaning Preservation Failure. The text fails on multiple high-priority checks. The primary failure is the inability to preserve the core meaning and fidelity of the original text. The MeaningBERT score of 0.651 is significantly below the required 0.75 threshold. The BERTScore of 0.8692 is also below the 0.90 minimum. Additionally, the text fails the CEFR compliance check, registering as B1 instead of the required A2.\n\n- Meaning Preservation Failure (MeaningBERT 0.651): The original text states the goal is to 'knock it out of its orbit enough for Earth-based telescopes to pick up'. Your version simplifies this to 'change a small space rock' and 'see the change'. This is too vague and loses the specific scientific concepts of redirection and observation, which are central to the original message.\n\n- Fidelity Failure (BERTScore 0.8692): Key lexical items from the original text were lost. The full name 'Double Asteroid Redirection Test' was removed, and the specific word 'impact' was replaced with the generic 'hit', reducing fidelity.\n\n- CEFR Compliance Failure (Classifier: B1): The text was classified as B1, which is too complex. The sentence 'Scientists hope Earth telescopes can see the change' uses an implied 'that-clause' ('hope that...'), which is a B1 grammatical structure.\n\n- Suggestion: Restore the core meaning. State that the test is to 'move' or 'push' the moon, not just 'change' it. Rephrase the final sentence to remove the B1 structure. Example: 'Scientists will use telescopes on Earth. They want to see the moon move.'",
    "metrics": {
      "cefr_compliance": "B1",
      "bertscore": 0.8692,
      "meaningbert": 0.651
    },
    "created_at": "2025-09-01 17:20:25.712275"
  },
  "attempt_number": 11,
  "best_attempt": {
    "id": "f90c1aba-854e-44e6-baa1-d283e94122d1",
    "cefr_level": "A2",
    "text_id": "text_001",
    "text_translated": "There is a test called DART.  \nDART stands for Double Asteroid Redirection Test.  \nThe test will hit Didymoon.  \nDidymoon is a small moon of the asteroid Didymos.  \nDidymoon is about 150 metres wide.  \nDidymos is about 800 metres wide.  \nThe test will try to knock Didymoon out of its orbit.  \nScientists hope the change will be enough for Earth telescopes to see.",
    "version": 10,
    "created_at": "2025-09-01 17:19:25.222289",
    "updated_at": "2025-09-01 17:19:25.222290",
    "metrics_meaningbert": 0.6855,
    "metrics_cefr_compliance": "A2"
  }
}