{
  "text": {
    "id": "de8d2514-c382-48b2-a737-e2ee99a29b85",
    "cefr_level": "B1",
    "text_id": "text_001",
    "text_translated": "In 2010, NASA's team that protects Earth from space objects recognized and recorded 90% of the asteroids near Earth that were 1km wide. These are called 'near-Earth objects' (NEOs), which are as big as mountains and are found within 50 million kilometres of Earth's orbit. NASA still needs to find about 50 more. However, NASA knows about 887 NEOs, and the agency says that none of these are a significant danger to the planet.",
    "version": 11,
    "created_at": "2025-09-01 17:27:51.411014",
    "updated_at": "2025-09-01 17:27:51.411018",
    "metrics_meaningbert": null,
    "metrics_cefr_compliance": null
  },
  "feedback": {
    "id": "a74dedb1-9de8-489f-9d99-defd910957e5",
    "approval": "FAIL",
    "grade": 4,
    "feedback": "FAIL: CEFR Compliance. The text was classified as 'B2', which is above the required 'B1' level. While the MeaningBERT and BERTScore metrics indicate good preservation of meaning and fidelity, the sentence structures used are too complex for a B1 audience. For example, the sentence 'In 2010, NASA's team that protects Earth from space objects recognized and recorded 90% of the asteroids near Earth that were 1km wide' contains two relative clauses modifying different nouns, which increases its structural complexity. Similarly, the sentence 'These are called 'near-Earth objects' (NEOs), which are as big as mountains and are found within 50 million kilometres of Earth's orbit' uses a relative clause with a compound predicate ('which are as big as mountains and are found within...'), making it more challenging. The final sentence, 'However, NASA knows about 887 NEOs, and the agency says that none of these are a significant danger to the planet', is a compound-complex sentence that combines multiple clauses and connectors ('However', 'and', 'that'-clause), which is characteristic of B2 level writing. To achieve B1 compliance, consider breaking down longer sentences into shorter, simpler ones. For instance, split sentences with multiple clauses or compound predicates into two distinct sentences. Ensure that complex grammatical structures are simplified or rephrased to reduce cognitive load for the target audience.",
    "metrics": {
      "cefr_compliance": "B2",
      "bertscore": 0.9399,
      "meaningbert": 0.8353
    },
    "created_at": "2025-09-01 17:28:10.259279"
  },
  "attempt_number": 11,
  "best_attempt": {
    "id": "1b53ca88-513e-4815-b20b-66698194fc5d",
    "cefr_level": "B1",
    "text_id": "text_001",
    "text_translated": "In 2010, NASA's planetary defence team identified and logged 90% of the asteroids near Earth, which were 1km wide. These are called 'near-Earth objects' (NEOs), which are objects close to Earth that are as big as mountains and include anything within 50 million kilometres of Earth's orbit. With an estimated 50 more to log, NASA says that none of the 887 NEOs it knows about are a significant danger to the planet.",
    "version": 5,
    "created_at": "2025-09-01 17:24:22.963345",
    "updated_at": "2025-09-01 17:24:22.963348",
    "metrics_meaningbert": 0.9368,
    "metrics_cefr_compliance": "B2"
  }
}