{
  "A1": [
    "bookshop",
    "city center",
    "bathroom",
    "interested",
    "app",
    "shoulder",
    "Jane",
    "west",
    "idea",
    "short",
    "tomato",
    "seventeen",
    "quick",
    "bottle",
    "badminton",
    "quickly",
    "where",
    "Miss",
    "yellow",
    "go to sleep",
    "best",
    "town center",
    "rubber",
    "date",
    "pair",
    "green",
    "Ben",
    "make",
    "subject",
    "desk",
    "fast",
    "interesting",
    "that",
    "bread",
    "snow",
    "thousand",
    "Thursday",
    "than",
    "bookcase",
    "Fred",
    "farmer",
    "common",
    "mistake",
    "colour",
    "student",
    "field",
    "hundred",
    "circle",
    "toy",
    "statement",
    "stomach-ache",
    "awake",
    "cafe",
    "my",
    "cent",
    "Sally",
    "grape",
    "understand",
    "world",
    "dolphin",
    "toothbrush",
    "song",
    "more",
    "salt",
    "then",
    "June",
    "lots of",
    "well",
    "Jill",
    "love",
    "by",
    "everybody",
    "earache",
    "have to",
    "toothpaste",
    "paragraph",
    "aunt",
    "through",
    "long",
    "telephone",
    "party",
    "or",
    "rug",
    "bus station",
    "meeting",
    "many",
    "give",
    "robot",
    "tree",
    "swim",
    "machine",
    "Peter",
    "clown",
    "usually",
    "gray",
    "add",
    "dancing",
    "shirt",
    "train",
    "dangerous",
    "tiger",
    "sports centre",
    "dress",
    "Jim",
    "throw",
    "candy",
    "negative",
    "guess",
    "beer",
    "text",
    "wall",
    "potato",
    "man",
    "question",
    "other",
    "read",
    "afraid",
    "go shopping",
    "exciting",
    "order",
    "window",
    "sugar",
    "wash",
    "complete",
    "beach",
    "tick",
    "some",
    "miss",
    "thank you",
    "will",
    "shoe",
    "teach",
    "write",
    "check",
    "fair",
    "eat",
    "happy",
    "something",
    "funfair",
    "all right",
    "would",
    "near",
    "August",
    "wave",
    "front",
    "double",
    "sweet",
    "lion",
    "this",
    "stomach",
    "tablet",
    "laugh",
    "design",
    "pop star",
    "Dan",
    "model",
    "dictionary",
    "across",
    "video",
    "right",
    "trip",
    "dark",
    "shall",
    "boyfriend",
    "much",
    "matter",
    "sentence",
    "improve",
    "Friday",
    "no",
    "two",
    "return",
    "hop",
    "boring",
    "card",
    "health",
    "carefully",
    "radio",
    "pay",
    "sixteen",
    "ask",
    "quarter",
    "player",
    "spider",
    "even",
    "online",
    "must",
    "water",
    "behind",
    "today",
    "hippo",
    "map",
    "fill",
    "second",
    "would like",
    "next",
    "winter",
    "family",
    "let’s",
    "kiwi",
    "as",
    "if",
    "crocodile",
    "expensive",
    "spring",
    "policeman",
    "probably",
    "baseball",
    "asleep",
    "OK",
    "inside",
    "often",
    "weekend",
    "burger",
    "both",
    "pet",
    "police",
    "amazing",
    "college",
    "when",
    "message",
    "month",
    "careful",
    "page",
    "Matt",
    "boy",
    "oh",
    "result",
    "helmet",
    "plate",
    "look for",
    "grey",
    "TV/television",
    "journey",
    "us",
    "net",
    "final",
    "problem",
    "armchair",
    "e-book",
    "arrive",
    "dream",
    "dog",
    "land",
    "mat",
    "country",
    "naughty",
    "sad",
    "elephant",
    "cloud",
    "close",
    "Mr",
    "fat",
    "tonight",
    "hi",
    "school",
    "upstairs",
    "whale",
    "listen",
    "artist",
    "moon",
    "agree",
    "of",
    "routine",
    "April",
    "animal",
    "supermarket",
    "but",
    "share",
    "mean",
    "object",
    "singer",
    "wake (up)",
    "half",
    "happen",
    "city centre",
    "skill",
    "milkshake",
    "sometimes",
    "bottom",
    "bye",
    "stairs",
    "career",
    "later",
    "me too",
    "grandpa",
    "September",
    "bath",
    "tail",
    "news",
    "driver",
    "Sue",
    "still",
    "ninety",
    "dollar",
    "monster",
    "street",
    "worker",
    "new",
    "part",
    "park",
    "husband",
    "silly",
    "try",
    "on",
    "board",
    "strong",
    "shout",
    "wind",
    "balcony",
    "film star",
    "round",
    "nurse",
    "match (contest)",
    "festival",
    "teddy (bear)",
    "discuss",
    "mouse (computer)",
    "few",
    "fly",
    "mouse",
    "shark",
    "Vicky",
    "cage",
    "a lot",
    "writing",
    "reading",
    "Clare",
    "skate",
    "bad",
    "stair",
    "Lily",
    "Ann/Anna",
    "pirate",
    "center",
    "playground",
    "course",
    "snake",
    "kid",
    "meal",
    "like (similar)",
    "should",
    "all",
    "tired",
    "roof",
    "blonde",
    "down",
    "nine",
    "o’clock",
    "form",
    "brilliant",
    "menu",
    "type",
    "call",
    "circus",
    "kind (type)",
    "foot/feet",
    "for",
    "same",
    "eight",
    "everything",
    "ground",
    "jump",
    "November",
    "warm",
    "classroom",
    "clock",
    "six",
    "away",
    "sleep",
    "December",
    "holiday",
    "an",
    "juice",
    "class",
    "bear",
    "early",
    "dad",
    "band",
    "useful",
    "bed",
    "thanks",
    "hospital",
    "shopping",
    "man/men",
    "young",
    "fact",
    "kangaroo",
    "car",
    "fishing",
    "die",
    "ten",
    "sports center",
    "dinner",
    "kitten",
    "leaf/leaves",
    "nothing",
    "Alice",
    "autumn",
    "crayon",
    "after",
    "space",
    "breakfast",
    "first",
    "he",
    "sick",
    "Julia",
    "another",
    "how old",
    "opinion",
    "bus",
    "title",
    "hey",
    "girl",
    "windy",
    "similar",
    "Tuesday",
    "five",
    "shower",
    "panda",
    "puppy",
    "May",
    "worst",
    "red",
    "learn",
    "story",
    "person",
    "frog",
    "we",
    "thirteen",
    "build",
    "see",
    "apple",
    "opposite",
    "yesterday",
    "terrible",
    "project",
    "temperature",
    "hall",
    "fantastic",
    "comic",
    "meat",
    "drop",
    "jeans",
    "natural",
    "Tom",
    "helicopter",
    "sit",
    "explain",
    "draw",
    "newspaper",
    "count",
    "mother",
    "badly",
    "slowly",
    "old",
    "chicken",
    "here",
    "egg",
    "shop",
    "ticket",
    "lie",
    "dish",
    "test",
    "tooth/teeth",
    "visit",
    "begin",
    "grandson",
    "win",
    "sea",
    "doll",
    "look",
    "want",
    "take a photo/picture",
    "personal",
    "Grace",
    "moment",
    "book",
    "hope",
    "summer",
    "twenty",
    "alphabet",
    "duck",
    "business",
    "team",
    "climb",
    "dialogue",
    "phrase",
    "again",
    "plant",
    "money",
    "seven",
    "describe",
    "which",
    "people",
    "ugly",
    "wet",
    "lamp",
    "glasses",
    "paint",
    "excuse me",
    "last (final)",
    "over",
    "cup",
    "feel",
    "go to bed",
    "true",
    "nose",
    "ride",
    "information",
    "seventy",
    "gym",
    "action",
    "pencil",
    "hair",
    "think",
    "television",
    "a lot of",
    "topic",
    "also",
    "neighbour",
    "married",
    "carrot",
    "shopping center",
    "beginning",
    "send",
    "hate",
    "choose",
    "actress",
    "vacation",
    "cow",
    "geography",
    "compare",
    "let",
    "leave",
    "teacher",
    "frightened",
    "real",
    "until\tup",
    "in",
    "orange",
    "life",
    "granddaughter",
    "father",
    "art",
    "how many",
    "living room",
    "lemon",
    "hooray",
    "fall",
    "pretty",
    "bike",
    "famous",
    "good",
    "morning",
    "twelve",
    "event",
    "dentist",
    "favourite",
    "table tennis",
    "hotel",
    "place",
    "left",
    "jungle",
    "closed",
    "price",
    "banana",
    "fourth",
    "address",
    "lime",
    "loud",
    "who",
    "shopping centre",
    "meet",
    "neck",
    "guitar",
    "metre",
    "cousin",
    "sport",
    "bird",
    "run",
    "Kim",
    "come on",
    "hurt",
    "really",
    "October",
    "perfect",
    "future",
    "find",
    "curly",
    "sandwich",
    "baby",
    "remember",
    "sauce",
    "clean",
    "just",
    "brave",
    "me",
    "quite",
    "treasure",
    "grandfather",
    "bedroom",
    "box",
    "wine",
    "bag",
    "grown-up",
    "grass",
    "correct",
    "pea",
    "bounce",
    "like (find sb/sth pleasant)",
    "time",
    "most",
    "hers",
    "hard",
    "noise",
    "extra",
    "job",
    "slow",
    "hello",
    "next to",
    "dress up",
    "lorry",
    "pen",
    "fix",
    "trousers",
    "hat",
    "she",
    "main",
    "moustache",
    "scientist",
    "writer",
    "pear",
    "weather",
    "eleven",
    "possible",
    "soup",
    "dear",
    "skateboarding",
    "Pat",
    "big",
    "be",
    "mum",
    "swimming pool",
    "person/people",
    "spelling",
    "magazine",
    "include",
    "uncle",
    "cool",
    "lesson",
    "euro",
    "local",
    "him",
    "no one",
    "answer",
    "out of",
    "ball",
    "piano",
    "parent",
    "zoo",
    "break",
    "well done",
    "mountain",
    "cheap",
    "customer",
    "soon",
    "how",
    "black",
    "parrot",
    "feed",
    "coat",
    "study",
    "play",
    "live",
    "Zoe",
    "ice",
    "past",
    "laptop",
    "woman",
    "Jack",
    "pool",
    "during",
    "before",
    "kind",
    "girlfriend",
    "only",
    "goal",
    "name",
    "passport",
    "sunny",
    "spell",
    "get off",
    "like",
    "clap",
    "rabbit",
    "forest",
    "Mary",
    "game",
    "grow",
    "smile",
    "late",
    "pick up",
    "cry",
    "activity",
    "language",
    "quiet",
    "wow",
    "cinema",
    "little",
    "bee",
    "stay",
    "fire",
    "get on",
    "basketball",
    "thank",
    "outside",
    "group",
    "village",
    "each",
    "snail",
    "interview",
    "umbrella",
    "university",
    "eye",
    "website",
    "shape",
    "busy",
    "basement",
    "cook",
    "million",
    "age",
    "below",
    "kick",
    "travel",
    "huge",
    "mile\tmilk",
    "with",
    "number",
    "lunch",
    "rainbow",
    "fine",
    "catch",
    "towel",
    "countryside",
    "birthday",
    "donkey",
    "line",
    "Lucy",
    "whose",
    "dining room",
    "need",
    "pig",
    "cat",
    "a/an",
    "truck",
    "get",
    "jacket",
    "thing",
    "talk",
    "advice",
    "taxi",
    "hold",
    "fun",
    "tooth",
    "concert",
    "office",
    "speak",
    "rule",
    "its",
    "rain",
    "company",
    "sorry",
    "nineteen",
    "alien",
    "key",
    "popular",
    "purple",
    "kilometre",
    "river",
    "white",
    "capital",
    "plane",
    "get undressed",
    "toothache",
    "rice",
    "dry",
    "cannot",
    "child",
    "bowl",
    "English",
    "word",
    "phone",
    "sweet(s)",
    "ship",
    "cut",
    "prepare",
    "description",
    "drink",
    "their",
    "sound",
    "have (got) to",
    "get dressed",
    "garden",
    "reader",
    "mine",
    "polar bear",
    "drawing",
    "repeat",
    "excited",
    "horse",
    "pasta",
    "follow",
    "meatballs",
    "period",
    "lift",
    "stair(s)",
    "very",
    "delicious",
    "bill",
    "pink",
    "science",
    "worse",
    "grandma",
    "his",
    "how often",
    "flight",
    "fifty",
    "head",
    "finish",
    "ear",
    "they",
    "modern",
    "boat",
    "night",
    "cloudy",
    "sure",
    "back",
    "fifteen",
    "put",
    "however",
    "music",
    "never",
    "get up",
    "help",
    "small",
    "large",
    "pineapple",
    "work",
    "working",
    "earth",
    "cough",
    "club",
    "sofa",
    "tell",
    "keyboard",
    "start",
    "waiter",
    "Saturday",
    "day",
    "glass",
    "air",
    "enough",
    "Daisy",
    "culture",
    "pound",
    "hour",
    "wait",
    "hockey",
    "ruler",
    "reason",
    "up",
    "table",
    "list",
    "bank (money)",
    "have",
    "lot",
    "chart",
    "lose",
    "Charlie",
    "north",
    "square",
    "internet",
    "cake",
    "floor",
    "imagine",
    "hide",
    "our",
    "I",
    "scary",
    "loudly",
    "sky",
    "create",
    "safe",
    "March",
    "pardon",
    "television/TV",
    "chair",
    "see you",
    "email",
    "sister",
    "come",
    "without",
    "from",
    "blanket",
    "south",
    "camera",
    "fourteen",
    "coconut",
    "house",
    "mouse/mice",
    "shorts",
    "forget",
    "difficult",
    "don’t worry",
    "roller skating",
    "history",
    "body",
    "cold",
    "town/city centre",
    "tall",
    "know",
    "invite",
    "fries",
    "plan",
    "flower",
    "building",
    "four",
    "important",
    "end",
    "store",
    "bicycle",
    "oh dear",
    "eighteen",
    "swimsuit",
    "motorbike",
    "elevator",
    "meaning",
    "cheese",
    "baseball cap",
    "sand",
    "maybe",
    "poor",
    "coffee",
    "article",
    "clothes",
    "great",
    "decide",
    "thin",
    "butter",
    "apartment",
    "those",
    "any",
    "leg",
    "lizard",
    "eraser",
    "CD",
    "conversation",
    "do",
    "about",
    "grandmother",
    "situation",
    "balloon",
    "special",
    "sausage",
    "friendly",
    "picture",
    "prefer",
    "museum",
    "put on",
    "car park",
    "airport",
    "door",
    "angry",
    "between",
    "market",
    "road",
    "tennis racket",
    "tourist",
    "lake",
    "along",
    "theirs",
    "Sunday",
    "room",
    "false",
    "carry",
    "cost",
    "skip",
    "foot",
    "sheep",
    "thirsty",
    "walk",
    "restaurant",
    "picnic",
    "exercise",
    "hobby",
    "painting",
    "detail",
    "doctor",
    "July",
    "third",
    "zebra",
    "take off",
    "area",
    "skateboard",
    "above",
    "surprised",
    "actor",
    "brown",
    "feeling",
    "cupboard",
    "there",
    "practice",
    "goat",
    "easy",
    "last",
    "Nick",
    "daughter",
    "homework",
    "hot",
    "swimming",
    "rich",
    "welcome",
    "Sam",
    "ice skates",
    "yes",
    "lemonade",
    "bored",
    "score",
    "wake",
    "wife",
    "drive",
    "take",
    "product",
    "town",
    "and",
    "yours",
    "full",
    "it",
    "star",
    "different",
    "sock",
    "mango",
    "stop",
    "diet",
    "fish",
    "practise",
    "look at",
    "poster",
    "move",
    "downstairs",
    "mouth",
    "sun",
    "onion",
    "these",
    "ours",
    "into",
    "because",
    "can",
    "enjoy",
    "cream",
    "post",
    "somebody",
    "sixty",
    "partner",
    "noodles",
    "scarf",
    "quietly",
    "bat",
    "chocolate",
    "theatre",
    "roller skates",
    "cross",
    "east",
    "beautiful",
    "adult",
    "mirror",
    "kite",
    "anything",
    "section",
    "seat",
    "sail",
    "Mark",
    "island",
    "around",
    "why",
    "home",
    "way",
    "Alex",
    "have got",
    "change",
    "success",
    "friend",
    "tractor",
    "skirt",
    "one",
    "blue",
    "rock",
    "T-shirt",
    "handbag",
    "movie",
    "face",
    "introduce",
    "how much",
    "size",
    "grandparent",
    "traffic",
    "watch",
    "letter",
    "report",
    "afternoon",
    "anyone",
    "twice",
    "toilet",
    "believe",
    "century",
    "pepper",
    "at",
    "soccer",
    "February",
    "January",
    "tea",
    "the",
    "off",
    "positive",
    "café",
    "open",
    "watermelon",
    "DVD",
    "Monday",
    "funny",
    "centre",
    "please",
    "hear",
    "Eva",
    "woman/women",
    "ready",
    "ill",
    "o'clock",
    "once",
    "vegetable",
    "three",
    "computer",
    "dancer",
    "wonderful",
    "year",
    "town centre",
    "out",
    "everyone",
    "under",
    "high",
    "better",
    "sell",
    "classmate",
    "shell",
    "pie",
    "your",
    "film",
    "too",
    "kitchen",
    "comic book",
    "visitor",
    "else",
    "sweater",
    "in front of",
    "photograph",
    "giraffe",
    "hand",
    "free",
    "own",
    "wear",
    "example",
    "hit",
    "be called",
    "could",
    "station",
    "dance",
    "arm",
    "week",
    "tennis",
    "library",
    "relax",
    "point",
    "always",
    "straight",
    "note",
    "spend",
    "every",
    "football",
    "now",
    "light (from the sun/a lamp)",
    "buy",
    "ice skating",
    "healthy",
    "milk",
    "a",
    "style",
    "teenager",
    "evening",
    "wrong",
    "fruit",
    "board game",
    "penguin",
    "TV",
    "flat",
    "pancake",
    "born",
    "Mrs",
    "farm",
    "Paul",
    "salad",
    "midnight",
    "fifth",
    "say",
    "present",
    "ice cream",
    "cooking",
    "hungry",
    "city/town centre",
    "her",
    "not",
    "thirty",
    "exam",
    "far",
    "boot",
    "food",
    "interest",
    "nice",
    "use",
    "nobody",
    "paper",
    "bus stop",
    "join",
    "city",
    "beard",
    "photo",
    "member",
    "so",
    "clever",
    "Hugo",
    "what",
    "go",
    "stand",
    "monkey",
    "you",
    "forty",
    "blond(e)",
    "brother",
    "Wednesday",
    "waterfall",
    "programme",
    "headache",
    "someone",
    "difference",
    "bring",
    "them",
    "chips",
    "keep",
    "show",
    "piece",
    "boots",
    "Bill",
    "child/children",
    "to",
    "become",
    "eighty",
    "minute",
    "weak",
    "jellyfish",
    "lots",
    "goodbye",
    "turn",
    "son",
    "ago",
    "bean",
    "tomorrow",
    "top",
    "together",
    "dirty",
    "ever",
    "blog",
    "sing"
  ],
  "A2": [
    "CD player",
    "DVD player",
    "Dr",
    "France.",
    "French fries",
    "Guess what?",
    "ID",
    "ID card",
    "MP3 player",
    "Ms",
    "OK/okay",
    "Olympic",
    "PC",
    "Yeah!",
    "a few",
    "a.m.",
    "ability",
    "able",
    "abroad",
    "accept",
    "accident",
    "according to",
    "achieve",
    "acre",
    "act",
    "active",
    "actually",
    "ad",
    "adapt",
    "advanced",
    "advantage",
    "adventure",
    "advert",
    "advertise",
    "advertisement",
    "advertising",
    "aeroplane",
    "affect",
    "afterwards",
    "against",
    "aged",
    "ah",
    "airline",
    "alarm clock",
    "album",
    "alive",
    "all right/alright",
    "all sorts of",
    "all the time",
    "allow",
    "almost",
    "alone",
    "already",
    "alright",
    "alternative",
    "although",
    "amazed",
    "ambulance",
    "among",
    "amount",
    "ancient",
    "anger",
    "angle",
    "ankle",
    "anxiety",
    "any more",
    "anybody",
    "anymore",
    "anyway",
    "anywhere",
    "apartment building",
    "appear",
    "appearance",
    "apply",
    "appointment",
    "architect",
    "architecture",
    "argue",
    "argument",
    "armed",
    "army",
    "arrange",
    "arrangement",
    "arrow",
    "artistic",
    "artwork",
    "as well",
    "assistant",
    "at all",
    "athlete",
    "attack",
    "attend",
    "attention",
    "attractive",
    "audience",
    "audio",
    "author",
    "autumn)",
    "available",
    "average",
    "avoid",
    "award",
    "awesome",
    "awful",
    "awkward",
    "background",
    "backpack",
    "badge",
    "bake",
    "balanced",
    "bank",
    "bar",
    "barbecue/ barbeque",
    "based",
    "bathing suit",
    "bathing suit)",
    "bathtub",
    "battery",
    "bear (animal)",
    "beat",
    "because of",
    "beef",
    "beg",
    "beginner",
    "behave",
    "behaviour",
    "belong",
    "belt",
    "benefit",
    "bent",
    "beside",
    "bet",
    "billion",
    "bin",
    "biology",
    "birth",
    "biscuit",
    "bit",
    "blackboard",
    "blank",
    "block",
    "blood",
    "blouse",
    "blow",
    "board.",
    "boil",
    "boiled",
    "bone",
    "book.",
    "bookshelf",
    "bookstore",
    "borrow",
    "boss",
    "bother",
    "bracelet",
    "brain",
    "break down",
    "brick",
    "bridge",
    "bright",
    "bring back",
    "broken",
    "brush",
    "bullet",
    "burn",
    "bush",
    "business person",
    "businessman",
    "businesswoman",
    "butterfly",
    "button",
    "by accident",
    "by the way",
    "cafe/café",
    "cafeteria",
    "calendar",
    "camel",
    "camp",
    "camping",
    "campsite",
    "cap",
    "care",
    "carpet",
    "cartoon",
    "case",
    "cash",
    "castle",
    "cause",
    "ceiling",
    "celebrate",
    "celebrity",
    "cell",
    "cell phone",
    "centimetre/centimeter",
    "centre/center",
    "cereal",
    "certain",
    "certainly",
    "chain",
    "chance",
    "channel",
    "character",
    "charity",
    "chase",
    "chat",
    "chatroom",
    "cheer",
    "chef",
    "chemist",
    "chemistry",
    "cheque",
    "chess",
    "chilli",
    "chip",
    "choice",
    "chop",
    "church",
    "cigarette",
    "classic",
    "classical",
    "cleaner",
    "clear",
    "clearly",
    "click",
    "climate",
    "climbing",
    "clip",
    "close to",
    "closet",
    "clothing",
    "coach",
    "coast",
    "code",
    "cola",
    "colleague",
    "collect",
    "column",
    "comb",
    "come back",
    "comedy",
    "comfortable",
    "comment",
    "communicate",
    "community",
    "compete",
    "competition",
    "competition?",
    "complain",
    "completely",
    "condition",
    "conference",
    "congratulations!",
    "connect",
    "connected",
    "consider",
    "contact",
    "contain",
    "context",
    "continent",
    "continue",
    "control",
    "cooker",
    "cookie",
    "copy",
    "corner",
    "correctly",
    "corridor",
    "costume",
    "couple",
    "course.",
    "cover",
    "cowboy",
    "crack",
    "crazy",
    "creative",
    "credit",
    "credit card",
    "cricket",
    "crime",
    "criminal",
    "crossing",
    "crowd",
    "crowded",
    "curry",
    "curtain",
    "curved",
    "cycle",
    "cycling",
    "daily",
    "danger",
    "dare",
    "darkness",
    "data",
    "dead",
    "deadly",
    "deal",
    "death",
    "decision",
    "deep",
    "definitely",
    "degree",
    "delay",
    "delight",
    "deliver",
    "department",
    "department store",
    "depend",
    "desert",
    "designer",
    "dessert",
    "destroy",
    "details",
    "detective",
    "develop",
    "device",
    "diary",
    "differently",
    "digital",
    "digital camera",
    "dinosaur",
    "diploma",
    "direct",
    "direction",
    "directions",
    "director",
    "disagree",
    "disappear",
    "disaster",
    "disc",
    "disco",
    "discount",
    "discover",
    "discovery",
    "discussion",
    "disease",
    "distance",
    "distant",
    "dive",
    "diving",
    "divorced",
    "document",
    "dot",
    "download",
    "drama",
    "dramatic",
    "drawer",
    "dressed",
    "driving",
    "driving licence",
    "drug",
    "drugstore",
    "drum",
    "dump",
    "each other",
    "earn",
    "earring",
    "earth",
    "easily",
    "edit",
    "education",
    "effect",
    "either",
    "elect",
    "electric",
    "electrical",
    "electricity",
    "electronic",
    "emotional",
    "employ",
    "employee",
    "employer",
    "empty",
    "ending",
    "energy",
    "engine",
    "engineer",
    "enormous",
    "enter",
    "entire",
    "entrance",
    "envelope",
    "environment",
    "equipment",
    "error",
    "especially",
    "essay",
    "everyday",
    "everywhere",
    "evidence",
    "exact",
    "exactly",
    "examination/exam",
    "excellent",
    "except",
    "excuse",
    "exhibition",
    "exist",
    "expect",
    "experience",
    "experiment",
    "expert",
    "explanation",
    "explore",
    "explorer",
    "express",
    "expression",
    "extreme",
    "extremely",
    "fabric",
    "fabulous",
    "factor",
    "factory",
    "fail",
    "faith",
    "fake",
    "fame",
    "fan",
    "fantasy",
    "farming",
    "fashion",
    "fast food",
    "fear",
    "feather",
    "feature",
    "feelings",
    "female",
    "fiction",
    "fight",
    "figure",
    "file",
    "fill in",
    "film.",
    "finally",
    "find out",
    "finger",
    "first name",
    "first of all",
    "firstly",
    "fit",
    "flame",
    "flash",
    "flu",
    "flying",
    "focus",
    "fog",
    "foggy",
    "folder",
    "following",
    "footballer",
    "foreign",
    "fork",
    "formal",
    "fortunate",
    "fortunately",
    "forward",
    "found",
    "freedom",
    "fresh",
    "fridge",
    "fried",
    "fur",
    "furious",
    "furniture",
    "further",
    "gallery",
    "gallon",
    "gaming",
    "gap",
    "garage",
    "garlic",
    "gas",
    "gas station",
    "gate",
    "general",
    "get back",
    "get fit",
    "get married",
    "gift",
    "give back",
    "give somebody a call/ring",
    "glad",
    "globe",
    "glove",
    "go out",
    "god",
    "gold",
    "golden",
    "golf",
    "good afternoon",
    "good evening",
    "good morning",
    "good night",
    "good-looking",
    "goodness",
    "government",
    "grade",
    "gram(me)",
    "grand",
    "grand(d)ad",
    "grandchild",
    "granny",
    "greet",
    "grilled",
    "grocery store",
    "grow up",
    "guest",
    "guest-house",
    "guide",
    "guidebook",
    "gun",
    "guy",
    "habit",
    "half-price",
    "happily",
    "harbour",
    "harm",
    "harmful",
    "have got to",
    "headphones",
    "headteacher",
    "heal",
    "heart",
    "heat",
    "heating",
    "heaven",
    "heavy",
    "height",
    "hell",
    "helpful",
    "hero",
    "herself",
    "hilarious",
    "hill",
    "himself",
    "hip hop",
    "hole",
    "holy",
    "homeless",
    "honesty",
    "honey",
    "hook",
    "horrible",
    "horror",
    "housewife",
    "human",
    "humorous",
    "humour",
    "hurry",
    "icon",
    "ideal",
    "identification",
    "identify",
    "illness",
    "image",
    "immediately",
    "impossible",
    "impress",
    "in class.)",
    "included",
    "including",
    "increase",
    "incredible",
    "independent",
    "individual",
    "indoor",
    "indoors",
    "industry",
    "info",
    "informal",
    "ingredient",
    "injury",
    "insect",
    "insert",
    "instead",
    "instead of",
    "instruction",
    "instructions",
    "instructor",
    "instrument",
    "intelligent",
    "international",
    "introduction",
    "invent",
    "invention",
    "invitation",
    "involve",
    "item",
    "itself",
    "jacket(n)",
    "jam",
    "jazz",
    "jewellery",
    "joke",
    "journalist",
    "joy",
    "jumper",
    "kid(s)",
    "kill",
    "kilogram)",
    "kilogramme",
    "king",
    "kiss",
    "kit",
    "knee",
    "knife",
    "knock",
    "knowledge",
    "lab",
    "lady",
    "lane",
    "latest",
    "laughter",
    "law",
    "lawyer",
    "lazy",
    "lead",
    "leader",
    "lean",
    "learning",
    "least",
    "leather",
    "lecture",
    "left-hand",
    "lend",
    "length",
    "lens",
    "less",
    "level",
    "licence",
    "lie down",
    "lifestyle",
    "light",
    "light (a lamp)",
    "light (not heavy)",
    "lighting",
    "likely",
    "link",
    "listener",
    "litre",
    "lock",
    "look after",
    "look out",
    "lost",
    "lots / a lot",
    "lovely",
    "low",
    "loyal",
    "luck",
    "luckily",
    "lucky",
    "luggage",
    "lunchtime",
    "lung",
    "lyric",
    "mad",
    "mail",
    "main course",
    "major",
    "make sure",
    "make-up",
    "male",
    "manage",
    "manager",
    "manner",
    "mark",
    "marker",
    "marry",
    "match",
    "material",
    "math)",
    "mathematics",
    "maths",
    "maths/mathematics",
    "may",
    "may modal",
    "mechanic",
    "medal",
    "media",
    "medical",
    "medicine",
    "melon",
    "melt",
    "memorable",
    "memory",
    "mention",
    "metal",
    "method",
    "midday",
    "middle",
    "might",
    "mile",
    "mind",
    "mine (belongs to me)",
    "mineral water",
    "minus",
    "minutes.",
    "missing",
    "mix",
    "mixed",
    "mobile",
    "mom",
    "monthly",
    "mostly",
    "motor",
    "motorcycle",
    "motorway",
    "movement",
    "movie star",
    "movie theater",
    "moving",
    "mug",
    "mushroom",
    "musical",
    "musician",
    "myself",
    "mysterious",
    "myth",
    "naked",
    "narrow",
    "national",
    "nationality",
    "nature",
    "nearly",
    "necessary",
    "necklace",
    "neither",
    "nervous",
    "network",
    "noisy",
    "none",
    "noon",
    "normal",
    "normally",
    "notebook",
    "notice",
    "novel",
    "nowhere",
    "nut",
    "occupation",
    "ocean",
    "of course",
    "offer",
    "office.",
    "officer",
    "oh dear!",
    "oil",
    "omelette",
    "onto",
    "opera",
    "opportunity",
    "optimistic",
    "option",
    "ordinary",
    "organ",
    "organisation",
    "organise",
    "original",
    "ourselves",
    "outdoor",
    "outdoors",
    "oven",
    "owner",
    "oxygen",
    "p.m.",
    "pack",
    "pain",
    "painter",
    "palace",
    "pale",
    "palm",
    "panic",
    "pants",
    "parking",
    "parking lot",
    "particular",
    "pass",
    "passenger",
    "password",
    "patch",
    "path",
    "patience",
    "patient",
    "pattern",
    "peace",
    "pence",
    "pencil case",
    "penfriend",
    "penny",
    "per",
    "per cent",
    "perform",
    "performance",
    "perfume",
    "perhaps",
    "permission",
    "personality",
    "petrol",
    "petrol station",
    "pharmacy",
    "photo(graph)",
    "photographer",
    "photography",
    "physical",
    "physics",
    "pick",
    "pillow",
    "pilot",
    "pity",
    "pizza",
    "planet",
    "plastic",
    "platform",
    "pleasant",
    "pleased",
    "plus",
    "pocket",
    "pointed",
    "police car",
    "police officer",
    "police station",
    "polite",
    "pollution",
    "poor thing/you",
    "pop",
    "population",
    "port",
    "position",
    "possession",
    "possibility",
    "possibly",
    "post office",
    "postcard",
    "power",
    "praise",
    "predict",
    "prefer / would prefer",
    "president",
    "prevent",
    "pride",
    "print",
    "printer",
    "prison",
    "prize",
    "process",
    "produce",
    "professional",
    "professor",
    "profile",
    "program",
    "progress",
    "promise",
    "pronounce",
    "protect",
    "provide",
    "pub",
    "public",
    "publish",
    "pull",
    "pupil",
    "purchase",
    "purpose",
    "purse",
    "push",
    "puzzle",
    "quality",
    "quantity",
    "queen",
    "quiz",
    "race",
    "race (run)",
    "racket",
    "railway",
    "raincoat",
    "raise",
    "rap",
    "rat",
    "rate",
    "rather",
    "reach",
    "react",
    "realize",
    "receipt",
    "receive",
    "recent",
    "recently",
    "reception",
    "receptionist",
    "recipe",
    "recognise",
    "recommend",
    "record",
    "recording",
    "recycle",
    "reduce",
    "refer",
    "refrigerator",
    "refuse",
    "region",
    "regular",
    "relationship",
    "relaxing",
    "remove",
    "rent",
    "repair",
    "replace",
    "reply",
    "reporter",
    "request",
    "research",
    "researcher",
    "respond",
    "response",
    "rest",
    "review",
    "ridiculous",
    "right hand",
    "ring",
    "rise",
    "risky",
    "roast",
    "role",
    "root",
    "roundabout",
    "route",
    "rub",
    "rubbish",
    "rude",
    "rugby",
    "runner",
    "running",
    "rural",
    "rush",
    "sadly",
    "sailing",
    "salary",
    "sale",
    "satisfaction",
    "save",
    "scare",
    "scared",
    "scene",
    "schedule",
    "schoolchild",
    "scissors",
    "scooter",
    "scratch",
    "screen",
    "search",
    "season",
    "second (next)",
    "secondly",
    "secret",
    "secretary",
    "seem",
    "selfie",
    "sense",
    "separate",
    "series",
    "serious",
    "serve",
    "service",
    "set",
    "settle",
    "several",
    "sexy",
    "shake",
    "shame",
    "shampoo",
    "sheet",
    "shelf",
    "shop assistant",
    "shot",
    "shut",
    "shy",
    "sibling",
    "side",
    "sidewalk",
    "sightseeing",
    "sign",
    "silver",
    "simple",
    "since",
    "sincere",
    "singing",
    "single",
    "sink",
    "sir",
    "sit down",
    "site",
    "sitting room",
    "skating",
    "ski",
    "skiing",
    "skilled",
    "skin",
    "skull",
    "slave",
    "slice",
    "slide",
    "slim",
    "slogan",
    "smart",
    "smartphone",
    "smell",
    "smoke",
    "smoking",
    "snack",
    "snowboard",
    "snowboarding",
    "soap",
    "social",
    "social media",
    "society",
    "soft",
    "software",
    "soldier",
    "solution",
    "solve",
    "somewhere",
    "sort",
    "source",
    "spare",
    "speaker",
    "specific",
    "speech",
    "speed",
    "split",
    "spoon",
    "stadium",
    "staff",
    "stage",
    "stamp",
    "stare",
    "state",
    "steady",
    "steak",
    "steal",
    "steam",
    "steel",
    "step",
    "stomach ache",
    "stone",
    "storm",
    "strange",
    "strategy",
    "strawberry",
    "stress",
    "stretch",
    "striped",
    "stripes",
    "structure",
    "studies",
    "stuff",
    "stunning",
    "stupid",
    "succeed",
    "successful",
    "such",
    "suddenly",
    "suggest",
    "suggestion",
    "suit",
    "suitcase",
    "sunglasses",
    "super",
    "supper",
    "support",
    "suppose",
    "surf",
    "surfboard",
    "surfing",
    "surname",
    "surprise",
    "surprising",
    "survey",
    "swallow",
    "swear",
    "sweep",
    "swimming costume",
    "symbol",
    "sympathy",
    "system",
    "tag",
    "take part",
    "tale",
    "tank",
    "target",
    "task",
    "taste",
    "tasty",
    "teaching",
    "technology",
    "teen",
    "teenage",
    "temple",
    "tent",
    "term",
    "terror",
    "text message",
    "textbook",
    "themselves",
    "thick",
    "thief",
    "thinking",
    "thought",
    "threaten",
    "thunderstorm",
    "tidy",
    "tidy up",
    "tie",
    "tights",
    "till",
    "timetable",
    "tip",
    "to travel by air",
    "toast",
    "toe",
    "tone",
    "tool",
    "total",
    "touch",
    "tough",
    "tour",
    "tour guide",
    "tourism",
    "tourist information centre",
    "towards",
    "tower",
    "trace",
    "track",
    "tradition",
    "traditional",
    "traffic light",
    "tragic",
    "trainer",
    "training",
    "tram",
    "transport",
    "trap",
    "traveller",
    "tropical",
    "trouble",
    "truly",
    "try on",
    "tune",
    "turn off",
    "turn on",
    "twin",
    "typical",
    "tyre",
    "underground",
    "understanding",
    "unfortunately",
    "unhappy",
    "uniform",
    "unique",
    "unit",
    "united",
    "until",
    "unusual",
    "upload",
    "upset",
    "used to",
    "useless",
    "user",
    "usual",
    "v/versus",
    "valley",
    "van",
    "variety",
    "various",
    "vehicle",
    "video game",
    "view",
    "violin",
    "virus",
    "visual",
    "vitamin",
    "vocabulary",
    "voice",
    "waitress",
    "wake up",
    "walking",
    "wallet",
    "wander",
    "war",
    "wardrobe",
    "wash up",
    "washing",
    "washing machine",
    "washing-up",
    "wealthy",
    "web",
    "web page",
    "wedding",
    "weekday",
    "weekly",
    "weight",
    "weird",
    "well known",
    "well.",
    "wheel",
    "while",
    "whisper",
    "whole",
    "wide",
    "wifi",
    "wild",
    "wildlife",
    "windsurfing",
    "winner",
    "wire",
    "wish",
    "wolf",
    "wood",
    "wooden",
    "wool",
    "work out",
    "worm",
    "worried",
    "worry",
    "wrist",
    "write down",
    "yesterday.",
    "yet",
    "yog(h)urt",
    "yourself",
    "zero"
  ],
  "B1": [
    "Adele.",
    "Australia.",
    "CV",
    "DJ",
    "Look out!",
    "Madam",
    "OK / O.K. / okay",
    "Tuesday?",
    "York?",
    "absent",
    "absolutely",
    "academic",
    "accent",
    "acceptable",
    "access",
    "accidentally",
    "accommodation",
    "accompany",
    "account",
    "accountant",
    "accurate",
    "accuse",
    "ache",
    "achievement",
    "acknowledge",
    "acquire",
    "actually very nice.",
    "addiction",
    "addition",
    "additional",
    "adequate",
    "admire",
    "admission",
    "admit",
    "adopt",
    "advance",
    "advise",
    "afford",
    "affordable",
    "agency",
    "agenda",
    "agent",
    "ages",
    "aggressive",
    "agreement",
    "agriculture",
    "ahead",
    "aim",
    "air conditioning",
    "air force",
    "alarm",
    "alcohol",
    "alcoholic",
    "alike",
    "aloud",
    "altogether",
    "ambition",
    "ambitious",
    "amusing",
    "analyse",
    "analysis",
    "anniversary",
    "announce",
    "announcement",
    "annoy",
    "annoyed",
    "annoying",
    "annual",
    "answer now?",
    "answerphone",
    "ant",
    "antique",
    "anxious",
    "apart",
    "apart from",
    "apologise",
    "apology",
    "apparent",
    "applicant",
    "application",
    "appreciate",
    "approach",
    "appropriate",
    "approval",
    "approve",
    "approximately",
    "arrest",
    "arrival",
    "as long as",
    "ashamed",
    "aspirin",
    "assignment",
    "assist",
    "assistance",
    "assume",
    "assure",
    "astronaut",
    "at first",
    "at last",
    "at least",
    "at once",
    "at present",
    "at the same time",
    "athletics",
    "atmosphere",
    "attach",
    "attempt",
    "attitude",
    "attract",
    "attraction",
    "authority",
    "aware",
    "babysit",
    "babysitter",
    "backpacker",
    "backpacking",
    "backwards",
    "baggage",
    "baker",
    "balance",
    "bald",
    "ballet",
    "ban",
    "bandage",
    "bank (river)",
    "bank account",
    "banking",
    "barbecue",
    "barber",
    "barely",
    "base",
    "base on",
    "basic",
    "basically",
    "basin",
    "basis",
    "basket",
    "battle",
    "bay",
    "be over",
    "beautiful countryside.",
    "beauty",
    "belief",
    "bell",
    "bend",
    "beneath",
    "beneficial",
    "besides",
    "bestseller",
    "beyond",
    "biography",
    "bite",
    "bitter",
    "blame",
    "bleed",
    "blind",
    "blogger",
    "boarding pass",
    "bold",
    "bomb",
    "booking",
    "booking office",
    "border",
    "borrow)",
    "bother!’",
    "brake",
    "branch",
    "brand",
    "brand new",
    "break in",
    "break up",
    "breath",
    "breathe",
    "breathing",
    "breeze",
    "bride",
    "brief",
    "briefly",
    "bring up",
    "broad",
    "broccoli",
    "brochure",
    "bubble",
    "bucket",
    "budget",
    "bug",
    "bulb",
    "bunch",
    "burning",
    "bury",
    "business.",
    "butcher",
    "buyer",
    "by hand",
    "by mistake",
    "by name",
    "cab",
    "cabbage",
    "cabin",
    "cabinet",
    "cable",
    "café/cafe",
    "calculate",
    "calculator",
    "calf",
    "call for",
    "call in",
    "call.",
    "calm",
    "campaign",
    "campus",
    "canal",
    "cancel",
    "cancer",
    "candidate",
    "candle",
    "canteen",
    "capable",
    "captain",
    "capture",
    "cardboard",
    "careless",
    "carry on",
    "carry out",
    "cashpoint",
    "casual",
    "category",
    "cathedral",
    "cattle",
    "cave",
    "celebration",
    "centimeter)",
    "centimetre",
    "central",
    "central heating",
    "centre.",
    "ceremony",
    "certificate",
    "challenge",
    "challenging",
    "champion",
    "championship",
    "changing room",
    "chapter",
    "charge",
    "charming",
    "chat show",
    "cheat",
    "check in",
    "check out",
    "check-in",
    "checkout",
    "cheek",
    "cheerful",
    "cheers!",
    "chemical",
    "chest",
    "chest of drawers",
    "childhood",
    "chin",
    "citizen",
    "claim",
    "clarify",
    "clause",
    "client",
    "cliff",
    "clinic",
    "closely",
    "cloth",
    "clue",
    "coal",
    "cod",
    "coin",
    "cold.",
    "collar",
    "collection",
    "coloured",
    "colourful",
    "combination",
    "combine",
    "comfort",
    "comma",
    "commercial",
    "commit",
    "commonly",
    "communication",
    "comparison",
    "competitive",
    "competitor",
    "complaint",
    "complex",
    "complicated",
    "composition",
    "computer.",
    "concentrate",
    "concerned",
    "conclude",
    "conclusion",
    "conduct",
    "confidence",
    "confident",
    "confirm",
    "conflict",
    "confuse",
    "confused",
    "confusing",
    "confusion",
    "connection",
    "consequence",
    "consist",
    "consonant",
    "constant",
    "constantly",
    "consume",
    "consumer",
    "container",
    "content",
    "contents",
    "contest",
    "continuous",
    "contract",
    "contrast",
    "contribute",
    "convenient",
    "convince",
    "convinced",
    "corn",
    "correction",
    "cosy",
    "cottage",
    "cotton",
    "courage",
    "court",
    "covered",
    "crash",
    "creation",
    "creature",
    "crew",
    "critical",
    "criticism",
    "criticize",
    "crop",
    "cross out",
    "crossroads",
    "cruel",
    "cruise",
    "cucumber",
    "cultural",
    "cure",
    "curious",
    "curiously",
    "currency",
    "current",
    "currently",
    "curriculum",
    "cushion",
    "custom",
    "customs",
    "cut up",
    "cute",
    "cyclist",
    "damage",
    "damaged",
    "deadline",
    "deaf",
    "deal with",
    "debate",
    "debt",
    "decade",
    "declare",
    "decorate",
    "decrease",
    "deeply",
    "defeat",
    "defence",
    "defend",
    "define",
    "definite",
    "definition",
    "delete",
    "delighted",
    "delivery",
    "demand",
    "democracy",
    "demonstrate",
    "deny",
    "depart",
    "departure",
    "deposit",
    "depressed",
    "depression",
    "depth",
    "deserve",
    "despite",
    "destination",
    "detailed",
    "detect",
    "determine",
    "determined",
    "development",
    "diagram",
    "dial",
    "diamond",
    "differ",
    "difficulty",
    "dig",
    "directly",
    "dirt",
    "disabled",
    "disadvantage",
    "disappoint",
    "disappointed",
    "disappointing",
    "disappointment",
    "disc jockey",
    "disc/disk",
    "disco(theque)",
    "disgusting",
    "dishwasher",
    "disk",
    "dislike",
    "display",
    "distinguish",
    "district",
    "disturb",
    "diver",
    "diverse",
    "divide",
    "divorce",
    "doctor / Dr",
    "documentary",
    "documents?",
    "domestic",
    "dominate",
    "donate",
    "donation",
    "doubt",
    "dozen",
    "drag",
    "drunk",
    "due",
    "due to",
    "dull",
    "dust",
    "dustbin",
    "dusty",
    "duty",
    "duty-free",
    "duvet",
    "eager",
    "earthquake",
    "eastern",
    "easygoing",
    "economic",
    "economics",
    "economy",
    "edge",
    "editor",
    "educate",
    "educated",
    "educational",
    "effective",
    "effectively",
    "efficient",
    "effort",
    "elbow",
    "elder",
    "elderly",
    "election",
    "element",
    "elementary",
    "embarrassed",
    "embarrassing",
    "embassy",
    "emergency",
    "emotion",
    "emphasize",
    "employment",
    "enable",
    "encounter",
    "encourage",
    "end up",
    "enemy",
    "energy.",
    "engage",
    "engaged",
    "engineering",
    "enjoyable",
    "enough(adv,det",
    "enquire",
    "enquiry",
    "ensure",
    "entertain",
    "entertainment",
    "enthusiasm",
    "enthusiastic",
    "entry",
    "environmental",
    "episode",
    "equal",
    "equally",
    "era",
    "escape",
    "essential",
    "establish",
    "estimate",
    "ethnic",
    "evaluate",
    "even though",
    "eventually",
    "evil",
    "evolve",
    "examination",
    "examine",
    "examiner",
    "exams.",
    "exchange",
    "exchange rate",
    "excitement",
    "exhausted",
    "exit",
    "expand",
    "expectation",
    "expected",
    "expedition",
    "expense",
    "experienced",
    "experienced.",
    "explode",
    "explosion",
    "export",
    "expose",
    "extend",
    "extraordinary",
    "extreme sport",
    "face-to-face",
    "facilities",
    "failure",
    "fairly",
    "familiar",
    "fancy",
    "fare",
    "fascinating",
    "fashionable",
    "fasten",
    "fault",
    "favour",
    "fax",
    "fee",
    "feedback",
    "feel like",
    "fence",
    "ferry",
    "fetch",
    "fever",
    "fighting",
    "fill up",
    "film maker",
    "financial",
    "firefighter",
    "firework",
    "firm",
    "fitness",
    "fixed",
    "flag",
    "flavour",
    "float",
    "flood",
    "flour",
    "flow",
    "flute",
    "fold",
    "folk",
    "following week.",
    "fond",
    "fool",
    "forbidden",
    "force",
    "forecast",
    "foreigner",
    "forever",
    "forgive",
    "former",
    "fortnight",
    "fortune",
    "forward(s)",
    "foundation",
    "fountain",
    "frame",
    "freeze",
    "freezer",
    "freezing",
    "frequent",
    "frequently",
    "friendship",
    "frighten",
    "frightening",
    "frozen",
    "fry",
    "frying pan",
    "fuel",
    "fulfil",
    "full stop",
    "full time",
    "full- time",
    "full-time",
    "fully",
    "function",
    "funding",
    "furthest",
    "gain",
    "gang",
    "gather",
    "gay",
    "gender",
    "generally",
    "generate",
    "generation",
    "generous",
    "gentle",
    "gentleman",
    "gesture",
    "get along",
    "get down",
    "get in",
    "get rid of",
    "ghost",
    "giant",
    "give in",
    "give out",
    "give up",
    "give way",
    "glance",
    "global",
    "global warming",
    "go for",
    "go off",
    "go on",
    "goalkeeper",
    "goods",
    "gorgeous",
    "govern",
    "grab",
    "gradually",
    "graduate",
    "graduation",
    "grain",
    "grammar",
    "grant",
    "graphics",
    "grateful",
    "greatly",
    "greeting",
    "grill",
    "groom",
    "growth",
    "guarantee",
    "guard",
    "guideline",
    "guilty",
    "guitarist",
    "gum",
    "gymnastics",
    "habitat",
    "haircut",
    "hairdresser",
    "hairdryer",
    "hand in",
    "hand out",
    "hand-held",
    "handkerchief",
    "handle",
    "handsome",
    "handwriting",
    "hang",
    "hang out",
    "hang up",
    "happiness",
    "hardly",
    "hardware",
    "headline",
    "heater",
    "heavily",
    "heel",
    "herb",
    "heroine",
    "hidden",
    "highlight",
    "highly",
    "hike",
    "hire",
    "historic",
    "historical",
    "hitchhike",
    "hold up",
    "homepage",
    "honest",
    "honestly",
    "honeymoon",
    "hopeful",
    "hopefully",
    "hopeless",
    "host",
    "hostel",
    "household",
    "housework",
    "housing",
    "hug",
    "humid",
    "hunger",
    "hunt",
    "hunting",
    "hurricane",
    "hut",
    "ice hockey",
    "icy",
    "identity",
    "identity card",
    "ignore",
    "illegal",
    "illustrate",
    "imaginary",
    "imagination",
    "immediate",
    "immigrant",
    "immigration",
    "impact",
    "impatient",
    "imply",
    "import",
    "importance",
    "impressed",
    "impression",
    "impressive",
    "improvement",
    "in advance",
    "in case",
    "in fact",
    "in half",
    "in ink",
    "in love",
    "in order",
    "in order to",
    "in pencil",
    "in the end",
    "in time",
    "in two",
    "in)",
    "inch",
    "income",
    "incorrect",
    "incredibly",
    "indeed",
    "indicate",
    "indirect",
    "industrial",
    "infection",
    "influence",
    "inform",
    "initial",
    "injure",
    "injured",
    "ink",
    "inner",
    "innocent",
    "inquiry",
    "insist",
    "inspire",
    "install",
    "instance",
    "instant",
    "insurance",
    "intelligence",
    "intend",
    "intense",
    "intention",
    "intermediate",
    "interpret",
    "interrupt",
    "interval",
    "invasion",
    "invest",
    "investigate",
    "involved",
    "iron",
    "ironing",
    "isolated",
    "issue",
    "jail",
    "jar",
    "jealous",
    "jet",
    "jog",
    "jogging",
    "journal",
    "judge",
    "jug",
    "junior",
    "justice",
    "justify",
    "keen",
    "keep in",
    "keep on",
    "keep up",
    "keeper",
    "kettle",
    "killing",
    "kilometer)",
    "kind (caring)",
    "knit",
    "knock down",
    "label",
    "laboratory",
    "lack",
    "ladder",
    "lamb",
    "landscape",
    "late.",
    "lately",
    "launch",
    "lay",
    "layer",
    "leadership",
    "leading",
    "leaf",
    "league",
    "leave.",
    "legal",
    "legend",
    "leisure",
    "lettuce",
    "lie (tell a lie)",
    "lighter",
    "lightning",
    "limit",
    "limited",
    "lip",
    "liquid",
    "literature",
    "litter",
    "lively",
    "living",
    "load",
    "loan",
    "locate",
    "located",
    "location",
    "locker",
    "logical",
    "logo",
    "lonely",
    "long-term",
    "look forward to",
    "look like",
    "look up",
    "loose",
    "loss",
    "lottery",
    "luxury",
    "made of/from/out of",
    "magic",
    "magnificent",
    "mainly",
    "maintain",
    "majority",
    "makeup",
    "mall",
    "management",
    "manager, please?",
    "marketing",
    "marriage",
    "marvellous",
    "massive",
    "mate",
    "maths / mathematics",
    "maximum",
    "me.",
    "meanwhile",
    "measure",
    "medium",
    "membership",
    "mend",
    "mental",
    "mess",
    "messy",
    "microwave",
    "middle-aged",
    "mild",
    "military",
    "millimeter)",
    "millimetre",
    "mine (hole)",
    "minimum",
    "minor",
    "minority",
    "miserable",
    "mixture",
    "model.",
    "monument",
    "mood",
    "moral",
    "morning?",
    "mosquito",
    "motivate",
    "motivation",
    "motor-racing",
    "mud",
