{
  "text": {
    "id": "e241a7bb-e6bd-45ea-ba5c-b6943b23c578",
    "cefr_level": "A2",
    "text_id": "text_001",
    "text_translated": "Asteroids are big rocks in space. NASA is now trying to find some of the smaller asteroids. They are looking for asteroids that are 140 metres wide or bigger. NASA thinks there are about 25,000 of these asteroids. They found about 8,000. But they still need to find 17,000. This is very important. In 2013, a small asteroid exploded over a city in Russia. It was only 19 metres wide, but it hurt 1,200 people. So, these bigger asteroids are very dangerous if they come near Earth.",
    "version": 11,
    "created_at": "2025-08-31 20:38:49.419225",
    "updated_at": "2025-08-31 20:38:49.419228",
    "metrics_meaningbert": null,
    "metrics_cefr_compliance": null
  },
  "feedback": {
    "id": "0230573d-528f-49dc-b92c-2f21a90cad18",
    "approval": "PASS",
    "grade": 10,
    "feedback": "PASS: The text fully complies with the A2 standard.\n\n- Factual Accuracy: All data points (140 metres, 25,000, 8,000, 17,000, 19 metres, 1,200 people, 2013) are correct. The core message is preserved without error.\n- Metric Compliance: The MeaningBERT score of 0.81 and BERTScore of 0.92 are well above the required thresholds. The CEFR classifier correctly identifies the text as A2.\n- Vocabulary Control: The vocabulary is strictly limited to A1 and A2 levels. There are no instances of B1 or higher vocabulary.\n- Structural Simplicity: The text uses short, simple sentences and appropriate A2-level connectors ('but', 'so', 'if'). The opening sentence, 'Asteroids are big rocks in space,' is a model of effective A2 simplification.",
    "metrics": {
      "cefr_compliance": "A2",
      "bertscore": 0.9185,
      "meaningbert": 0.8089
    },
    "created_at": "2025-08-31 20:39:15.463334"
  },
  "attempt_number": 11,
  "best_attempt": {
    "id": "be813160-5441-42d6-9b26-195598099b5b",
    "cefr_level": "A2",
    "text_id": "text_001",
    "text_translated": "Asteroids are big rocks in space. NASA is now trying to find some of the smaller asteroids. They are looking for asteroids that are 140 metres wide or bigger. NASA thinks there are about 25,000 of these asteroids. They found about 8,000. But they still need to find 17,000.\n\nThis is very important. In 2013, a small asteroid exploded over a city in Russia. It was only 19 metres wide, but it hurt 1,200 people. So, these bigger asteroids are very dangerous if they come near Earth.",
    "version": 2,
    "created_at": "2025-08-31 20:33:08.569328",
    "updated_at": "2025-08-31 20:33:08.569338",
    "metrics_meaningbert": 0.8089,
    "metrics_cefr_compliance": "A2"
  }
}