{
  "text": {
    "id": "051c4aa0-2ecf-4719-9da1-8b1d69050b44",
    "cefr_level": "A2",
    "text_id": "text_001",
    "text_translated": "A civilisation is when many people live together. They have rules and make things like art.\nFrom 100,000 to 50,000 years before now, we find signs of early human civilisation. For example, we see paintings on rock walls. No one knows the link between this and language. Brains did not get bigger fast. But people got smarter. Did language make their brains grow? Or did their smart brains begin to make language?",
    "version": 2,
    "created_at": "2025-08-31 22:16:56.612977",
    "updated_at": "2025-08-31 22:16:56.612990",
    "metrics_meaningbert": null,
    "metrics_cefr_compliance": null
  },
  "feedback": {
    "id": "a98e3c52-3338-468b-a2a6-c28d8f71e9ad",
    "approval": "PASS",
    "grade": 10,
    "feedback": "PASS: The text successfully meets all CEFR A2 readability standards. It is factually accurate, preserves the core meaning with a MeaningBERT score of 0.7679, and maintains fidelity to the original with a BERTScore of 0.9245. The CEFR classifier correctly identified the text as A2. The vocabulary is appropriate for A2, with complex terms like 'civilisation' being clearly defined using simple A1/A2 language. Sentence structures are consistently short and simple, utilizing A2-level connectors such as 'and', 'but', and 'or'. Simplifications like 'rock walls' for 'cave paintings' and 'got smarter' for 'more complex and more intelligent' are excellent examples of A2 adaptation.",
    "metrics": {
      "cefr_compliance": "A2",
      "bertscore": 0.9245,
      "meaningbert": 0.7679
    },
    "created_at": "2025-08-31 22:17:09.383681"
  },
  "attempt_number": 2,
  "best_attempt": {
    "id": "09d09300-ab44-4d94-b6f1-d60e2c2fef07",
    "cefr_level": "A2",
    "text_id": "12-a2",
    "text_translated": "A civilisation is when many people live together. They have rules and make things like art.\n\nFrom 100,000 to 50,000 years before now, we find signs of early human civilisation. For example, we see cave paintings. No one knows the link between this and language. Brains did not get bigger fast. But people got smarter. Did language make their brains grow? Or did their smart brains begin to make language?",
    "version": 1,
    "created_at": "2025-08-31 22:16:49.591858",
    "updated_at": "2025-08-31 22:16:49.591863",
    "metrics_meaningbert": 0.7818,
    "metrics_cefr_compliance": "A2"
  }
}