{
  "text": {
    "id": "7175efd0-c3ca-45dc-b4f5-ee29ac541fb8",
    "cefr_level": "A2",
    "text_id": "text_001",
    "text_translated": "Before, I worked five days a week. This was my normal week. Then I had my children and took time off work. After this, I wanted to spend more time with my children before they started school. So I talked to my boss. My boss and I agreed. I can now work three days a week. This meant I got less money. It was a big cut in my pay. This is because I only get paid for the days I work. But I still have the same amount of work. I now do five days of work in only three days, but I get much less money.",
    "version": 16,
    "created_at": "2025-08-31 21:12:31.580607",
    "updated_at": "2025-08-31 21:12:31.580619",
    "metrics_meaningbert": null,
    "metrics_cefr_compliance": null
  },
  "feedback": {
    "id": "e1c5cdbd-d50a-4ad9-8cfa-561f40dafbc3",
    "approval": "PASS",
    "grade": 10,
    "feedback": "PASS. The output meets all A2 criteria without deviation.\n- Factual Integrity: The text is a 1:1 factual match with the original source. No information was lost or altered.\n- Meaning and Fidelity: The MeaningBERT score of 0.755 and BERTScore of 0.9117 are within the required thresholds, confirming that the core message and key lexical items have been preserved.\n- CEFR Compliance: The A2 classifier result is correct. The text exclusively uses A1 and A2 vocabulary as verified by the provided list. No B1+ vocabulary is present.\n- Structural Simplicity: Sentence structures are consistently simple. Complex ideas from the original, such as 'pro-rata basis' and 'negotiating', have been correctly broken down into short, sequential A2 sentences using appropriate connectors like 'so' and 'because'. The output is a model of compliance.",
    "metrics": {
      "cefr_compliance": "A2",
      "bertscore": 0.9117,
      "meaningbert": 0.755
    },
    "created_at": "2025-08-31 21:13:00.539809"
  },
  "attempt_number": 16,
  "best_attempt": {
    "id": "26942f4e-ed0f-4553-bd5f-65abe64e2c65",
    "cefr_level": "A2",
    "text_id": "text_001",
    "text_translated": "Before, I worked five days a week. This was my normal week. Then I had my children and took time off work. After this, I wanted to spend more time with my children before they started school. So I talked to my boss. We agreed that I could work three days a week. This meant I got less money. It was a big cut in my pay. This is because I only get paid for the days I work. But I still have the same amount of work. I now do five days of work in only three days, but I get much less money.",
    "version": 7,
    "created_at": "2025-08-31 21:06:33.914310",
    "updated_at": "2025-08-31 21:06:33.914310",
    "metrics_meaningbert": 0.7611,
    "metrics_cefr_compliance": "A2"
  }
}