{
  "text": {
    "id": "dc89a3f7-a386-46e8-a2e2-6d5ef72c0ae4",
    "cefr_level": "B1",
    "text_id": "text_001",
    "text_translated": "NASA is tracking smaller asteroids. These asteroids are at least 140 metres wide. Scientists think there are about 25,000 of them. They have recorded only about 8,000. That means about 17,000 are still unknown. The 2013 Chelyabinsk event was caused by a 19‑metre asteroid. It injured about 1,200 people. These middle‑sized asteroids are a serious danger. They could cause a lot of damage by entering Earth’s orbit.",
    "version": 11,
    "created_at": "2025-09-01 17:59:04.686133",
    "updated_at": "2025-09-01 17:59:04.686134",
    "metrics_meaningbert": null,
    "metrics_cefr_compliance": null
  },
  "feedback": {
    "id": "f52fc34d-e38b-43c2-905e-fd2b380661ee",
    "approval": "FAIL",
    "grade": 4,
    "feedback": "FAIL: CEFR Compliance. The text was classified as 'A2', which is below the required 'B1' target level. While the simplification is factually accurate and preserves the core meaning, it has been oversimplified. The output consists of a series of very short, simple sentences that lack the complexity and flow expected at a B1 level. For example, the sentences 'They have recorded only about 8,000. That means about 17,000 are still unknown.' are choppy. To correct this, combine sentences using B1-level connectors to create more complex structures and improve readability. A better alternative would be: 'Scientists think there are about 25,000 of them, but they have only recorded about 8,000, which means about 17,000 are still unknown.'",
    "metrics": {
      "cefr_compliance": "A2",
      "bertscore": 0.9233,
      "meaningbert": 0.873
    },
    "created_at": "2025-09-01 17:59:28.630690"
  },
  "attempt_number": 11,
  "best_attempt": {
    "id": "450313b5-3469-4b70-af62-c457c082dcf3",
    "cefr_level": "B1",
    "text_id": "text_001",
    "text_translated": "NASA is tracking smaller asteroids that are at least 140 metres wide. Scientists estimate that there are about 25,000 such asteroids, and only around 8,000 have been recorded so far, leaving roughly 17,000 still unknown. The 2013 Chelyabinsk event showed that a 19‑metre asteroid can be dangerous; it exploded over a Russian city and injured about 1,200 people. Therefore, these middle‑sized asteroids would be a serious danger if they moved into Earth's orbit.",
    "version": 6,
    "created_at": "2025-09-01 17:55:53.233313",
    "updated_at": "2025-09-01 17:55:53.233313",
    "metrics_meaningbert": 0.9091,
    "metrics_cefr_compliance": "B2"
  }
}