{
  "text": {
    "id": "ec69f0e4-d33f-42a0-8ebc-0c6308a7d2e6",
    "cefr_level": "A2",
    "text_id": "text_001",
    "text_translated": "Many bridge accidents happen when people are building the bridge. This is often because the people who plan the bridge make a mistake. For example, they made a mistake in their numbers. The bridge is not strong enough for its own weight, and it breaks. This is very dangerous for the workers on the bridge. They can die.",
    "version": 3,
    "created_at": "2025-09-01 10:30:48.190449",
    "updated_at": "2025-09-01 10:30:48.190461",
    "metrics_meaningbert": null,
    "metrics_cefr_compliance": null
  },
  "feedback": {
    "id": "8707db5b-8d6b-49e0-9101-189cea3a6b6f",
    "approval": "PASS",
    "grade": 10,
    "feedback": "PASS: The text fully complies with the A2 standard.\n\n- Factual Integrity: The output is a perfect factual match to the original text.\n- Metrics: All metrics are well within the required range. The MeaningBERT score of 0.78 and BERTScore of 0.92 indicate excellent preservation of the original message and key terms.\n- CEFR Compliance: The A2 classification is correct. The text demonstrates a model use of A2-level language.\n- Vocabulary: Vocabulary is strictly limited to A1 and A2 levels. No B1 or higher-level words were used.\n- Structure: Sentence structure is exemplary for A2. The original text's complex ideas, such as 'collapses under its own weight' and 'can be deadly', were correctly simplified into shorter, more direct sentences like 'it breaks' and 'They can die'.\n\nNo deviations from the A2 standard were detected. The output is a model example of simplification.",
    "metrics": {
      "cefr_compliance": "A2",
      "bertscore": 0.9227,
      "meaningbert": 0.7776
    },
    "created_at": "2025-09-01 10:31:08.933440"
  },
  "attempt_number": 3,
  "best_attempt": {
    "id": "33f3df8e-ad56-4091-9806-7ab9f6ba2849",
    "cefr_level": "A2",
    "text_id": "39-a2",
    "text_translated": "Many bridge accidents happen when people are building the bridge. This is often because the engineers make a mistake. For example, they calculate a number wrong. Then, the bridge falls down because it is too heavy. This is very dangerous for the workers on the bridge. They can die.",
    "version": 1,
    "created_at": "2025-09-01 10:29:53.135023",
    "updated_at": "2025-09-01 10:29:53.135026",
    "metrics_meaningbert": 0.8281,
    "metrics_cefr_compliance": "A2"
  }
}