{
  "text": {
    "id": "f597ec9a-94f9-489a-af69-f0863fa24810",
    "cefr_level": "B1",
    "text_id": "text_001",
    "text_translated": "The planetary defence team is a group of scientists at NASA that works to protect Earth from space rocks. They look for near‑Earth objects. Near‑Earth objects are space rocks that come within 50 million kilometres of Earth’s orbit. These objects can be as big as mountains and are about 1 km wide. By 2010 the team had recorded about 90 % of these asteroids. NASA knows about 887 objects and says none of them are a big danger to our planet. NASA says about 50 more objects still need to be recorded.",
    "version": 11,
    "created_at": "2025-09-01 17:42:33.783600",
    "updated_at": "2025-09-01 17:42:33.783610",
    "metrics_meaningbert": null,
    "metrics_cefr_compliance": null
  },
  "feedback": {
    "id": "15e9c8c0-14a6-45d6-922e-43114a67a292",
    "approval": "FAIL",
    "grade": 4,
    "feedback": "FAIL: CEFR Compliance. The text was classified as 'A2', which is below the required 'B1' target level. The simplification was too aggressive, resulting in overly simple sentence structures and vocabulary. The main issue is the choppy flow, exemplified by the sentences: 'They look for near‑Earth objects. Near‑Earth objects are space rocks...'. This repetition is characteristic of an A2 level. To achieve a B1 level, these sentences should be combined using a relative clause, for instance: 'They look for near-Earth objects, which are space rocks that come within 50 million kilometres of Earth’s orbit.' While the factual integrity was excellent and the keyword definitions were handled well, the failure to meet the target CEFR level is critical.",
    "metrics": {
      "cefr_compliance": "A2",
      "bertscore": 0.9092,
      "meaningbert": 0.8185
    },
    "created_at": "2025-09-01 17:42:54.202436"
  },
  "attempt_number": 11,
  "best_attempt": {
    "id": "1fbaa224-2899-4e42-96d8-c3eb9c311c46",
    "cefr_level": "B1",
    "text_id": "71-b1",
    "text_translated": "In 2010, NASA’s planetary protection team, which is a group of scientists that watches space for objects that could hit Earth, had already found and recorded about 90 % of the asteroids that are about 1 km wide and pass near our planet. These near‑Earth objects, which are rocks the size of mountains and are inside 50 million kilometres of Earth’s orbit, are what scientists keep track of. NASA estimates that about 50 more objects still need to be recorded, but it says none of the 887 known objects pose a big danger to our planet.",
    "version": 1,
    "created_at": "2025-09-01 17:38:21.175984",
    "updated_at": "2025-09-01 17:38:21.175988",
    "metrics_meaningbert": 0.8474,
    "metrics_cefr_compliance": "B2"
  }
}