{
  "text": {
    "id": "4b250fc9-ca1e-415b-a09d-4b4b68f61180",
    "cefr_level": "B1",
    "text_id": "text_001",
    "text_translated": "The “buy nothing” trend has now reached influencers, who are people that share ideas with many followers on social media, and who usually post about clothing and make‑up that they recommend to buy. However, some YouTube stars now encourage their viewers not to buy anything for periods as long as a year. Two friends in Canada spent a year working towards buying only food. For the first three months they learned how to live without buying electrical goods, clothes or other things for the house. In the next stage they gave up services, such as haircuts, eating out at restaurants or buying petrol for their cars. After one year they had saved $55,000.",
    "version": 2,
    "created_at": "2025-09-01 17:36:16.324308",
    "updated_at": "2025-09-01 17:36:16.324314",
    "metrics_meaningbert": null,
    "metrics_cefr_compliance": null
  },
  "feedback": {
    "id": "a97c5957-4cb9-4a6d-9c03-a1b3ae78626a",
    "approval": "PASS",
    "grade": 10,
    "feedback": "This is an excellent simplification that meets all B1 requirements. The text passes all priority checks, starting with perfect factual integrity. The MeaningBERT (0.95) and BERTScore (0.97) are very high, confirming that the original message and key details were fully preserved. The B1 CEFR classification is accurate. Diagnostically, the submission excels in its qualitative aspects. The key term 'influencers' was skillfully defined within the first sentence, which is a best practice for B1 simplification. The addition of the connector 'However' improves the logical flow of the text, and expanding the contraction 'they'd' to 'they had' enhances clarity for the target reader. No further improvements are needed.",
    "metrics": {
      "cefr_compliance": "B1",
      "bertscore": 0.9732,
      "meaningbert": 0.9453
    },
    "created_at": "2025-09-01 17:36:39.176095"
  },
  "attempt_number": 2,
  "best_attempt": {
    "id": "efcbe94f-1dda-4be6-b629-4550c4dd315a",
    "cefr_level": "B1",
    "text_id": "47-b1",
    "text_translated": "The “buy nothing” trend has now reached influencers, who are people that share ideas with many followers on social media, and who usually post about clothing and make‑up that they recommend to buy. However, some YouTube stars now encourage their viewers not to buy anything for periods as long as a year. Two friends in Canada spent a year trying to buy only food. For the first three months they learned how to live without buying electrical goods, clothes or other things for the house, and they found simple ways to reuse what they already had. In the next stage they gave up services, such as haircuts, eating out at restaurants or buying petrol for their cars, because they wanted to keep their spending low. After one year they had saved $55,000.",
    "version": 1,
    "created_at": "2025-09-01 17:36:12.432459",
    "updated_at": "2025-09-01 17:36:12.432466",
    "metrics_meaningbert": 0.9453,
    "metrics_cefr_compliance": "B1"
  }
}