{
  "text": {
    "id": "a2f30a65-11d3-4c56-95ff-76420d579a50",
    "cefr_level": "A2",
    "text_id": "text_001",
    "text_translated": "A hula hoop is a ring you move around your body.  \nThe Seven Summits are the highest mountains on each continent.  \nWasfia Nazreen first saw a hula hoop as a young girl.  \nShe saw it when a foreign child visited her native Bangladesh.  \nShe did not want to play.  \nShe stood by and watched the child play with it.  \nIn her country, people said girls should not play hula hoops.  \nThey also said girls should not ride bikes.  \nWasfia is one of the few people to climb the Seven Summits.  \nShe climbed Everest and Kilimanjaro.  \nShe is the first person to hula-hoop on each mountain top.  \nShe does it to help women and girls do sport.",
    "version": 16,
    "created_at": "2025-09-01 00:16:43.826226",
    "updated_at": "2025-09-01 00:16:43.826241",
    "metrics_meaningbert": null,
    "metrics_cefr_compliance": null
  },
  "feedback": {
    "id": "1f4c4530-9f3d-4943-8cc6-405f899aa55f",
    "approval": "FAIL",
    "grade": 3,
    "feedback": "FAIL: Fidelity Failure. The BERTScore of 0.8927 is below the required 0.90. Key terms like \"empower women and girls\" were replaced by less precise wording such as \"help women and girls do sport,\" losing critical lexical detail. The addition of definitions for \"hula hoop\" and \"Seven Summits\" adds new content not in the original and dilutes the original phrasing. Suggestion: Restore the exact phrase \"empower women and girls\". Remove added definitions. Keep original wording like \"native Bangladesh\" and \"reluctantly stood by and watched.\"",
    "metrics": {
      "cefr_compliance": "A2",
      "bertscore": 0.8927,
      "meaningbert": 0.7906
    },
    "created_at": "2025-09-01 00:17:01.912110"
  },
  "attempt_number": 16,
  "best_attempt": {
    "id": "b6af3b6e-7f90-48c6-8c19-42940f5a6bdd",
    "cefr_level": "A2",
    "text_id": "text_001",
    "text_translated": "A foreign child visited Bangladesh.  \nThat child played with a hula hoop.  \nWasfia Nazreen saw the hula hoop when she was a young girl.  \nWasfia watched. She did not join.  \nIn her country, people said girls should not play with hula hoops.  \nThey also said girls should not ride bikes.  \nNow Wasfia is one of the few people in the world to climb the Seven Summits, including Everest and Kilimanjaro.  \nShe is the first person to hula-hoop on each peak.  \nShe does it to empower women and girls.  \nPeople in her country say girls must not do sport.",
    "version": 13,
    "created_at": "2025-09-01 00:14:14.250742",
    "updated_at": "2025-09-01 00:14:14.250754",
    "metrics_meaningbert": 0.8462,
    "metrics_cefr_compliance": "A2"
  }
}