{
  "text": {
    "id": "37296e3c-b5ac-4e16-b04b-00bb7d6304ec",
    "cefr_level": "B1",
    "text_id": "text_001",
    "text_translated": "Asteroids that might hit Earth are rocks that pass less than 7.5 million kilometres from Earth's orbit. NASA has made a map of 1,400 of these rocks, but they do not expect any of them to be a danger in the next 100 years. NASA can use the technology they have now to follow these objects. They can also predict if they might hit Earth. If this happens, they could launch two ways to protect our planet.",
    "version": 4,
    "created_at": "2025-09-01 17:55:22.948108",
    "updated_at": "2025-09-01 17:55:22.948109",
    "metrics_meaningbert": null,
    "metrics_cefr_compliance": null
  },
  "feedback": {
    "id": "05910cb5-60a7-4aa4-9804-d11db31c8711",
    "approval": "PASS",
    "grade": 9,
    "feedback": "The text successfully passes all stages of the diagnostic protocol. There are no factual errors, and the meaning and fidelity metrics (MeaningBERT 0.8602, BERTScore 0.925) are well above the required thresholds, indicating excellent preservation of the original content. The CEFR classifier correctly identified the output as B1, demonstrating appropriate linguistic complexity. Qualitatively, the simplification is highly effective. The writer successfully transformed complex phrases such as 'Potentially Hazardous Asteroids' into 'Asteroids that might hit Earth' and 'defence solutions' into 'ways to protect our planet', which are excellent B1-level equivalents. The original's final complex sentence was skillfully broken down into three simpler sentences ('NASA can use the technology they have now to follow these objects. They can also predict if they might hit Earth. If this happens, they could launch two ways to protect our planet.'), significantly improving readability and flow for a B1 audience. The use of connectors like 'but', 'also', and 'If this happens' is appropriate for the target level. This is a strong example of effective text simplification.",
    "metrics": {
      "cefr_compliance": "B1",
      "bertscore": 0.925,
      "meaningbert": 0.8602
    },
    "created_at": "2025-09-01 17:55:45.232571"
  },
  "attempt_number": 4,
  "best_attempt": {
    "id": "37296e3c-b5ac-4e16-b04b-00bb7d6304ec",
    "cefr_level": "B1",
    "text_id": "text_001",
    "text_translated": "Asteroids that might hit Earth are rocks that pass less than 7.5 million kilometres from Earth's orbit. NASA has made a map of 1,400 of these rocks, but they do not expect any of them to be a danger in the next 100 years. NASA can use the technology they have now to follow these objects. They can also predict if they might hit Earth. If this happens, they could launch two ways to protect our planet.",
    "version": 4,
    "created_at": "2025-09-01 17:55:22.948108",
    "updated_at": "2025-09-01 17:55:22.948109",
    "metrics_meaningbert": 0.8602,
    "metrics_cefr_compliance": "B1"
  }
}