{
  "text": {
    "id": "405b05aa-df10-425f-bb6d-b1e360ae4a89",
    "cefr_level": "A2",
    "text_id": "text_001",
    "text_translated": "The Hunger Games is a successful book for teens and young people.  \nSuzanne Collins wrote it and it came out in 2008.  \nPeople translated it into 26 languages.  \nIt has sold millions of copies around the world.  \nIt was first young‑people book to sell over a million electronic copies.  \nIt is now a major Hollywood film.  \nThe film earned 152.5 million dollars in its first weekend.  \nThat was in North America.",
    "version": 5,
    "created_at": "2025-09-01 17:24:10.972211",
    "updated_at": "2025-09-01 17:24:10.972212",
    "metrics_meaningbert": null,
    "metrics_cefr_compliance": null
  },
  "feedback": {
    "id": "3c096745-1956-4ca2-b750-f5a6714e3e84",
    "approval": "PASS",
    "grade": 9,
    "feedback": "PASS: The text meets all A2 requirements. Factual Integrity: All facts, names, and numbers from the original text are correctly preserved. Metric Compliance: The MeaningBERT score of 0.8265 and BERTScore of 0.9131 are well within the required thresholds, indicating successful meaning preservation and lexical fidelity. CEFR Classification: The text correctly classified as A2. Structural Analysis: The use of short, simple sentences is exemplary for the A2 level. The decision to split the final fact about North America into a separate sentence is a correct simplification strategy. Vocabulary: The vocabulary is strictly limited to the A2 level. Words like 'successful' and 'major' are used appropriately. Minor Point for Improvement: The phrase 'young-people book' is grammatically awkward. Suggestion: Use 'book for young people' for better fluency while remaining within A2 constraints.",
    "metrics": {
      "cefr_compliance": "A2",
      "bertscore": 0.9131,
      "meaningbert": 0.8265
    },
    "created_at": "2025-09-01 17:24:36.961904"
  },
  "attempt_number": 5,
  "best_attempt": {
    "id": "e774b2e5-7be8-4d97-a5a2-56b94653da2a",
    "cefr_level": "A2",
    "text_id": "text_001",
    "text_translated": "textThe Hunger Games is a successful book for teens and young adults.  \nSuzanne Collins wrote it.  \nIt came out in 2008.  \nPeople translated it into 26 languages.  \nIt has sold millions of copies worldwide.  \nIt also sold more than a million electronic copies.  \nIt is now a major Hollywood film.  \nThe film earned 152.5 million dollars.  \nIt earned this in its opening weekend in North America.",
    "version": 3,
    "created_at": "2025-09-01 17:22:58.119864",
    "updated_at": "2025-09-01 17:22:58.119865",
    "metrics_meaningbert": 0.834,
    "metrics_cefr_compliance": "A2"
  }
}