{
  "text": {
    "id": "f55b703b-8cde-4c50-b2e5-4fcee6927b02",
    "cefr_level": "B1",
    "text_id": "text_001",
    "text_translated": "Asteroids are large rocks that travel in space. Some of them are called 'Potentially Hazardous'. This name tells us they could become a danger. This is because they can pass within 7.5 million kilometres of our planet's orbit. NASA has created a map of 1,400 of these objects, but they do not expect any of them to be a threat in the next one hundred years. NASA has technology that is already available. They can use it to track these asteroids and predict if one might hit Earth. In the case of a predicted impact, they could use two defence solutions.",
    "version": 6,
    "created_at": "2025-09-01 01:32:20.561530",
    "updated_at": "2025-09-01 01:32:20.561541",
    "metrics_meaningbert": null,
    "metrics_cefr_compliance": null
  },
  "feedback": {
    "id": "b56e95c4-ba6e-4833-ae4e-ce65a4ccbaa2",
    "approval": "FAIL",
    "grade": 5,
    "feedback": "FAIL: CEFR Compliance. The text was classified as 'B2', which is too complex for the required 'B1' target. The primary reason for this is the use of B2-level vocabulary and sentence structures. Specifically, the phrase 'Potentially Hazardous' retains a B2-level word. Additionally, the final sentence 'In the case of a predicted impact...' uses a formal structure that is more common at the B2 level. To correct this, consider rephrasing the name, for example: 'Some of these asteroids are called hazardous because they are potentially a danger.' For the final sentence, use a simpler conditional structure, such as: 'If they predict an asteroid will hit Earth, they could use two defence solutions.' The text successfully passed all factual and meaning preservation checks.",
    "metrics": {
      "cefr_compliance": "B2",
      "bertscore": 0.9217,
      "meaningbert": 0.8833
    },
    "created_at": "2025-09-01 01:32:45.111462"
  },
  "attempt_number": 6,
  "best_attempt": {
    "id": "b201b425-3446-4202-8e34-56aaf800378b",
    "cefr_level": "B1",
    "text_id": "text_001",
    "text_translated": "Asteroids are large rocks that travel in space. Some of them are called 'Potentially Hazardous'. This is because they can pass close enough to Earth to be a danger, within 7.5 million kilometres of our planet's orbit. NASA has created a map of 1,400 of these objects, but they do not expect any of them to be a threat in the next one hundred years. NASA has technology that is already available. They can use it to track these asteroids and predict if one might hit Earth. If NASA predicts an impact, they could use two defence solutions.",
    "version": 3,
    "created_at": "2025-09-01 01:29:47.983410",
    "updated_at": "2025-09-01 01:29:47.983422",
    "metrics_meaningbert": 0.9426,
    "metrics_cefr_compliance": "B2"
  }
}