{
  "text": {
    "id": "d1330169-e27a-4173-a34f-023807ef4b71",
    "cefr_level": "A2",
    "text_id": "text_001",
    "text_translated": "Society, not nature, says girls should like arts.  \nSociety also says girls should leave maths and physics to boys.  \nBecause of this, girls see few female scientists as role models.  \nCartoons often show a crazy scientist and a smart inventor as men.  \nThey also show an adventurous astronaut as a man.  \nSome people think scientists are not cool.  \nThey think scientists are not good with people.  \nSome think their work is alone and far from the world.  \nThe media shows false stereotypes.  \nThese ideas can make girls feel they are not scientists.  \nGirls may see science as a job not good for them.  \nIf girls see more good female scientists, they feel sure about science.  \nThey also feel they belong in those subjects.",
    "version": 11,
    "created_at": "2025-09-01 17:36:26.248109",
    "updated_at": "2025-09-01 17:36:26.248110",
    "metrics_meaningbert": null,
    "metrics_cefr_compliance": null
  },
  "feedback": {
    "id": "26556137-8954-4ca3-ab83-28c3f5d60129",
    "approval": "FAIL",
    "grade": 4,
    "feedback": "FAIL: Fidelity Failure. The BERTScore of 0.886 is below the required 0.90. This indicates a significant loss of key words and phrasing from the original text. The simplification was too aggressive.\n\n- Lexical Loss: Key descriptive words were over-simplified, causing the fidelity score to drop. 'Positive female role models' was reduced to 'good female scientists', 'genius inventor' became 'smart inventor', and 'unappealing career path' became 'a job not good for them'. This level of reduction loses too much lexical detail from the source.\n\n- Vocabulary Violation: The word 'astronaut' is B1 level. It was not simplified or defined as a keyword. This is an unacceptable deviation from the A2 vocabulary standard.\n\nSuggestion: Retain more specific A2-level adjectives from the original text to improve fidelity. Replace or define all words above the A2 level without exception. The word 'astronaut' must be replaced with a simpler term like 'person who goes to space'.",
    "metrics": {
      "cefr_compliance": "A2",
      "bertscore": 0.886,
      "meaningbert": 0.806
    },
    "created_at": "2025-09-01 17:37:01.986797"
  },
  "attempt_number": 11,
  "best_attempt": {
    "id": "b38f08e8-0227-4bd4-a35e-baed69260f4e",
    "cefr_level": "A2",
    "text_id": "text_001",
    "text_translated": "Society, not nature, tells girls to like arts.  \nIt says they should leave maths and physics to boys.  \nChildren do not see positive female role models in science jobs.  \nCartoons and stories often show a crazy scientist as a man.  \nThey show a smart maker as a man.  \nThey show a space traveler as a man.  \nThere is a bad idea that scientists are strange.  \nThey may have poor talking skills.  \nTheir work can be alone.  \nIt can be far from the world.  \nThese ideas are false and the media shows them.  \nThey may make girls not feel like scientists.  \nGirls may see science as a not interesting job.  \nIf girls saw more positive female role models in science, they would feel more sure of themselves.  \nThey would feel they belong in those subjects.",
    "version": 2,
    "created_at": "2025-09-01 17:30:11.489720",
    "updated_at": "2025-09-01 17:30:11.489721",
    "metrics_meaningbert": 0.903,
    "metrics_cefr_compliance": "A2"
  }
}