{
  "text": {
    "id": "3b02d091-5073-4777-9d49-06903e0abf7b",
    "cefr_level": "A2",
    "text_id": "text_001",
    "text_translated": "Over ten years, many big UK supermarkets and grocers came under fire.\nThey wasted tonnes of food.\nThey underpaid their suppliers.\nThey made too much plastic wastage in their packaging.\nThis hurt the environment.\nPeople complained about this.\nThen some big UK supermarkets and grocers signed a pact.\nThey are going to transform packaging and cut plastic wastage.",
    "version": 16,
    "created_at": "2025-09-01 00:15:30.334421",
    "updated_at": "2025-09-01 00:15:30.334424",
    "metrics_meaningbert": null,
    "metrics_cefr_compliance": null
  },
  "feedback": {
    "id": "36e79cc9-cf31-42ab-ac9f-f50556df088a",
    "approval": "FAIL",
    "grade": 3,
    "feedback": "FAIL: Meaning Preservation Failure. The MeaningBERT score of 0.6654 is below the required 0.75, indicating loss of the core message.  - The simplified line \"People complained about this\" removes the explicit link to consumer backlash against huge amounts of plastic waste.  - The detailed cause-and-effect nuance of \"growing consumer backlash against the huge amounts of plastic waste generated by plastic packaging\" is lost.  Suggestion: Restore the explicit mention of consumer backlash and the scale of plastic waste to preserve the original meaning.",
    "metrics": {
      "cefr_compliance": "B1",
      "bertscore": 0.9238,
      "meaningbert": 0.6654
    },
    "created_at": "2025-09-01 00:15:45.828422"
  },
  "attempt_number": 16,
  "best_attempt": {
    "id": "cd2f0dcf-de72-473d-af9c-e944e231ae47",
    "cefr_level": "A2",
    "text_id": "13-a2",
    "text_translated": "A supermarket is a big shop that sells food and other things.  \nPackaging is the paper, plastic or box around the things we buy.  \nMany supermarkets did bad things in the past ten years.  \nThey threw away a lot of food.  \nThey paid the people who made the food not enough money.  \nThey used too much plastic in their packaging.  \nThis hurt our environment.  \nNow supermarkets start to notice.  \nCustomers are angry because they see so much plastic.  \nSo some big UK supermarkets said they will change.  \nThey will change their packaging.  \nThey will use less plastic.",
    "version": 1,
    "created_at": "2025-09-01 00:03:19.547917",
    "updated_at": "2025-09-01 00:03:19.547921",
    "metrics_meaningbert": 0.6734,
    "metrics_cefr_compliance": "A2"
  }
}