{
  "text": {
    "id": "2abd23f4-8fd3-460f-bc22-6325f6001838",
    "cefr_level": "B1",
    "text_id": "text_001",
    "text_translated": "**Asteroids are large rocks that travel in space.** NASA is now working to find and record smaller asteroids that are 140 metres wide or more. NASA thinks there are about 25,000 asteroids of this size, but so far they have only found about 8,000 of them. So, there are still 17,000 that we do not know about. This is a serious problem. In 2013, a much smaller asteroid exploded over the city of Chelyabinsk in Russia. It was only 19 metres wide, but it injured 1,200 people. This shows how dangerous these middle-sized asteroids are, and they are a problem if they come close to Earth.",
    "version": 6,
    "created_at": "2025-09-01 01:11:19.002409",
    "updated_at": "2025-09-01 01:11:19.002410",
    "metrics_meaningbert": null,
    "metrics_cefr_compliance": null
  },
  "feedback": {
    "id": "be5a3305-464c-4026-9838-704e7b321755",
    "approval": "FAIL",
    "grade": 6,
    "feedback": "FAIL: CEFR Compliance. The text was classified as 'B2', which is too complex for the target B1 level. The failure is likely due to the final sentence: 'This shows how dangerous these middle-sized asteroids are, and they are a problem if they come close to Earth.' This sentence combines multiple clauses (a subordinate clause with 'how', a coordinating conjunction 'and', and a conditional 'if' clause), which pushes its complexity beyond the B1 threshold. Suggestion: Split this into two simpler sentences, such as: 'This shows that these middle-sized asteroids are very dangerous. They become a problem if they come close to Earth.' On a positive note, the submission is excellent in all other areas. Factual integrity is perfect, meaning and fidelity scores are high, and the vocabulary strategy, including the definition of 'asteroids', was executed correctly.",
    "metrics": {
      "cefr_compliance": "B2",
      "bertscore": 0.9261,
      "meaningbert": 0.8223
    },
    "created_at": "2025-09-01 01:11:43.193041"
  },
  "attempt_number": 6,
  "best_attempt": {
    "id": "bd40f3a5-fc61-4218-bb6b-6b269c08b842",
    "cefr_level": "B1",
    "text_id": "01-b1",
    "text_translated": "NASA is now working to find and record smaller **asteroids, which are large rocks that travel in space,** that are 140 metres wide or more. Although NASA thinks there are about 25,000 asteroids of this size, so far they have only found about 8,000 of them. This means there are still 17,000 that we do not know about. This is a serious problem because in 2013, a much smaller asteroid that was only 19 metres wide exploded over the city of Chelyabinsk in Russia and injured 1,200 people. For this reason, these middle-sized asteroids would be a serious danger if they come close to Earth.",
    "version": 1,
    "created_at": "2025-09-01 01:08:14.066277",
    "updated_at": "2025-09-01 01:08:14.066280",
    "metrics_meaningbert": 0.8482,
    "metrics_cefr_compliance": "B2"
  }
}