{
  "text": {
    "id": "180f575d-10d7-45ee-8322-f1d4764020af",
    "cefr_level": "B1",
    "text_id": "text_001",
    "text_translated": "Most types of spiders have venom. Venom is a poison they use to stop or kill their food, not to attack humans. In fact, only 25 known types of spider make venom that can actually harm humans. Although their bites can be painful, they rarely kill people. Australia's dangerous Sydney funnel-web spider has not caused any deaths since 1981. This is because a special medicine called anti-venom was created then. However, you should take care not to annoy hairy spiders like tarantulas. When they feel they are in danger, they defend themselves by releasing a cloud of irritating hairs. These hairs can get stuck in the skin or eyes of an attacker.",
    "version": 6,
    "created_at": "2025-09-01 10:56:20.633743",
    "updated_at": "2025-09-01 10:56:20.633754",
    "metrics_meaningbert": null,
    "metrics_cefr_compliance": null
  },
  "feedback": {
    "id": "2c1e94dc-cba5-42db-b739-dab8405dad88",
    "approval": "FAIL",
    "grade": 4,
    "feedback": "FAIL: Meaning Preservation. The MeaningBERT score of 0.7041 is below the required 0.75 threshold. This indicates a significant shift from the original text's core message. The failure is likely due to several cumulative simplifications that, while logical, altered the precise meaning. For example, changing the specific action 'stunning' to the more general verb 'stop' and simplifying the idiom 'rub up the wrong way' to 'annoy' contributed to this semantic drift. Additionally, the text failed the CEFR compliance check, receiving a 'B2' classification instead of the target 'B1'. This is likely because sentences such as 'Australia's dangerous Sydney funnel-web spider has not caused any deaths since 1981' use structures like the present perfect tense which, combined with other complex clauses, pushed the text's difficulty level too high. To correct this, aim to find closer B1 synonyms for key actions and consider further simplifying complex sentence structures to meet the B1 target.",
    "metrics": {
      "cefr_compliance": "B2",
      "bertscore": 0.9423,
      "meaningbert": 0.7041
    },
    "created_at": "2025-09-01 10:56:49.724398"
  },
  "attempt_number": 6,
  "best_attempt": {
    "id": "08e684c7-f30c-4a9b-b541-fcccc8142562",
    "cefr_level": "B1",
    "text_id": "113-b1",
    "text_translated": "Most types of spiders have venom, which is a poison they use to stop or kill their food rather than to attack humans. In fact, only 25 known types of spider make venom that can actually harm humans, and although their bites can be painful, they rarely kill people. For example, Australia's famous Sydney funnel-web spider has not caused any deaths since a special medicine called anti-venom was created in 1981. However, you should be careful with hairy spiders like tarantulas. When they feel they are in danger, they defend themselves by shooting out a cloud of special hairs, and these annoying hairs can get stuck in the skin or eyes of an attacker.",
    "version": 1,
    "created_at": "2025-09-01 10:52:34.552403",
    "updated_at": "2025-09-01 10:52:34.552405",
    "metrics_meaningbert": 0.7064,
    "metrics_cefr_compliance": "B2"
  }
}