{
  "text": {
    "id": "0ed9672f-ca7d-4777-97f5-6016d58dee6e",
    "cefr_level": "B1",
    "text_id": "text_001",
    "text_translated": "Supermarkets are large shops where people buy food and other daily items. Packaging means the materials used to wrap or protect products. Over the last ten years, many big supermarket chains have been criticised because they wasted large amounts of food, paid too little to their suppliers, and used too much plastic in their packaging. This plastic waste has harmed the environment. However, supermarkets and grocery shops have begun to pay attention to these issues. Because customers are unhappy about the large amounts of plastic waste from packaging, some of the biggest supermarkets in the UK have agreed to work together to change how they use packaging and to reduce plastic waste.",
    "version": 2,
    "created_at": "2025-08-31 23:11:27.323690",
    "updated_at": "2025-08-31 23:11:27.323695",
    "metrics_meaningbert": null,
    "metrics_cefr_compliance": null
  },
  "feedback": null,
  "attempt_number": 2,
  "best_attempt": {
    "id": "c2e9bf3a-f1e8-4d00-b443-ac4581391aa8",
    "cefr_level": "B1",
    "text_id": "13-b1",
    "text_translated": "Supermarkets are large shops where people buy food and other daily items. Packaging means the materials used to wrap or protect products. Many big supermarket chains have been criticised in the last ten years because they have wasted large amounts of food, paid too little to the people who supply them, and used too much plastic in their packaging, which has hurt the environment. However, supermarkets and shops that sell groceries have started to pay attention. Because customers are unhappy about the large amounts of plastic waste from packaging, some of the biggest supermarkets in the UK have agreed to work together to change packaging and reduce plastic waste.",
    "version": 1,
    "created_at": "2025-08-31 23:11:23.830026",
    "updated_at": "2025-08-31 23:11:23.830027",
    "metrics_meaningbert": 0.751,
    "metrics_cefr_compliance": "B1"
  }
}