{
  "text": {
    "id": "763a0de0-ee18-4e0d-b465-8533a6769ba6",
    "cefr_level": "A2",
    "text_id": "text_001",
    "text_translated": "In 2010, a team at NASA found and made a list of big asteroids near Earth. They found 90 per cent of the very big ones. These asteroids are 1km wide.\n\nNear-Earth objects are big rocks in space. They are near our planet, Earth. They are very big, like mountains. They are less than 50 million kilometres from Earth.\n\nNASA knows about 887 of these big asteroids. They think there are about 50 more to find. NASA says none of these 887 asteroids are a big danger to our planet.",
    "version": 3,
    "created_at": "2025-09-01 10:36:33.811033",
    "updated_at": "2025-09-01 10:36:33.811040",
    "metrics_meaningbert": null,
    "metrics_cefr_compliance": null
  },
  "feedback": {
    "id": "b75a4085-d668-44ad-8566-047671ddd1dc",
    "approval": "PASS",
    "grade": 10,
    "feedback": "PASS: Full Compliance. The text successfully passes all diagnostic checks for factual integrity, meaning preservation, and CEFR A2 compliance.\n\n- Factual Integrity: The output is a 1:1 match with the original text's facts, numbers, and core message.\n- Meaning and Fidelity: Metrics are excellent. MeaningBERT at 0.839 and BERTScore at 0.9077 confirm that the core meaning and key terms have been preserved with high fidelity.\n- CEFR Compliance: The classifier correctly identifies the text as A2. The qualitative audit confirms this.\n- Vocabulary: Vocabulary is strictly limited to the A2 level. All words used are appropriate for the target audience.\n- Structure: Sentence structure is exemplary. The use of short, simple sentences ensures maximum readability for an A2 learner. The keyword 'near-Earth objects' is defined clearly and simply within the text. No deviations detected.",
    "metrics": {
      "cefr_compliance": "A2",
      "bertscore": 0.9077,
      "meaningbert": 0.839
    },
    "created_at": "2025-09-01 10:36:54.384276"
  },
  "attempt_number": 3,
  "best_attempt": {
    "id": "c5b099ab-0a44-4640-9c93-460929fdac6a",
    "cefr_level": "A2",
    "text_id": "71-a2",
    "text_translated": "In 2010, a team at NASA looked for big asteroids near Earth. They found 90 percent of the very big ones. These asteroids are 1km wide.\n\nNear-Earth objects are big rocks in space. They are near our planet, Earth. They are very big, like mountains. They are less than 50 million kilometres from Earth.\n\nNASA found 887 of these big asteroids. They think there are about 50 more to find. NASA says these 887 asteroids are not a big danger to our planet.",
    "version": 1,
    "created_at": "2025-09-01 10:35:43.096275",
    "updated_at": "2025-09-01 10:35:43.096281",
    "metrics_meaningbert": 0.8609,
    "metrics_cefr_compliance": "A2"
  }
}