{
  "text": {
    "id": "d260f640-95b8-4714-8854-4b523c1658b5",
    "cefr_level": "A2",
    "text_id": "text_001",
    "text_translated": "The Hunger Games is an event. It happens every year. The `Capitol` is a place. It uses this event to make the areas think about this. The areas fought against the Capitol. The Capitol wants them to remember the bad thing they did.\nEvery year, one boy and one girl are chosen. They are from each area. They are 12 to 18 years old. People choose them by luck. These teenagers must fight in a big fight. Only one person can live. The others must die. These chosen teenagers are called `tributes`. They are the people who must fight. All the people in the country must watch this event on TV.",
    "version": 11,
    "created_at": "2025-09-01 17:59:32.442426",
    "updated_at": "2025-09-01 17:59:32.442430",
    "metrics_meaningbert": null,
    "metrics_cefr_compliance": null
  },
  "feedback": {
    "id": "6572bb86-5127-4398-932f-6a5ce67f63da",
    "approval": "FAIL",
    "grade": 3,
    "feedback": "FAIL: Meaning Preservation Failure. The MeaningBERT score of 0.6787 is below the required 0.75. The original text clearly states the Capitol uses the event to remind districts they are 'being punished for rebelling'. Your version dilutes this core message to 'make the areas think about this' and 'remember the bad thing they did', which significantly weakens the concept of ongoing punishment and its explicit reason. Additionally, the phrase 'The others must die' is an explicit addition not present in the original text, further altering the precise meaning conveyed.",
    "metrics": {
      "cefr_compliance": "A2",
      "bertscore": 0.9058,
      "meaningbert": 0.6787
    },
    "created_at": "2025-09-01 17:59:46.172638"
  },
  "attempt_number": 11,
  "best_attempt": {
    "id": "34cf9a3b-0ac4-4678-ac86-9d76baf30266",
    "cefr_level": "A2",
    "text_id": "text_001",
    "text_translated": "The Hunger Games is an event. It happens every year. The `Capitol` uses this event. It wants to remind the districts. The districts rebelled against the Capitol. So, the Capitol punishes them.\nEvery year, one boy and one girl are chosen. They are from each district. They are teenagers. They are 12 to 18 years old. People choose them by `lottery`. This means by chance. These teenagers must fight in a battle. Only one person can live. These chosen teenagers are called `tributes`. All the people in the nation must watch this event on TV.",
    "version": 3,
    "created_at": "2025-09-01 17:54:07.286460",
    "updated_at": "2025-09-01 17:54:07.286464",
    "metrics_meaningbert": 0.8485,
    "metrics_cefr_compliance": "A2"
  }
}