{
  "text": {
    "id": "7eff5de0-e487-4b75-85ef-80ed134358a5",
    "cefr_level": "B1",
    "text_id": "text_001",
    "text_translated": "Wasfia Nazreen first saw a hula hoop when she was a young girl. A hula hoop is a large plastic ring that you spin around your body. She saw a foreign child playing with one in her native Bangladesh. Wasfia reluctantly watched, as people in her country believed that girls should not play with hula hoops or ride bikes. Now, Wasfia is one of the few people in the world who have climbed the Seven Summits, including Everest and Kilimanjaro. She is also the first person to hula-hoop on each peak. She did this to give women and girls more confidence and strength in a country which discourages them from doing sport.",
    "version": 3,
    "created_at": "2025-08-31 22:35:01.410104",
    "updated_at": "2025-08-31 22:35:01.410104",
    "metrics_meaningbert": null,
    "metrics_cefr_compliance": null
  },
  "feedback": {
    "id": "7afbaa6a-fb87-488a-aeed-ad8e565c7e36",
    "approval": "PASS",
    "grade": 9,
    "feedback": "The text successfully passes all priority checks. Factual integrity is perfectly maintained, and both MeaningBERT (0.7687) and BERTScore (0.9637) are well above the required thresholds, indicating excellent preservation of meaning and fidelity. The CEFR classifier correctly identified the output as B1, demonstrating appropriate linguistic complexity. The writer effectively simplified complex sentence structures from the original, such as splitting the opening sentence and the one about the Seven Summits into multiple, more accessible B1-level sentences. The keyword 'hula hoop' was accurately and clearly defined, which is crucial for a B1 audience. Furthermore, the higher-level vocabulary word 'empower' was skillfully replaced with the B1-appropriate phrase 'give women and girls more confidence and strength', maintaining the original intent while simplifying the language. The overall flow and structure are coherent and easy to follow. This is a very strong simplification.",
    "metrics": {
      "cefr_compliance": "B1",
      "bertscore": 0.9637,
      "meaningbert": 0.7687
    },
    "created_at": "2025-08-31 22:35:22.403308"
  },
  "attempt_number": 3,
  "best_attempt": {
    "id": "7eff5de0-e487-4b75-85ef-80ed134358a5",
    "cefr_level": "B1",
    "text_id": "text_001",
    "text_translated": "Wasfia Nazreen first saw a hula hoop when she was a young girl. A hula hoop is a large plastic ring that you spin around your body. She saw a foreign child playing with one in her native Bangladesh. Wasfia reluctantly watched, as people in her country believed that girls should not play with hula hoops or ride bikes. Now, Wasfia is one of the few people in the world who have climbed the Seven Summits, including Everest and Kilimanjaro. She is also the first person to hula-hoop on each peak. She did this to give women and girls more confidence and strength in a country which discourages them from doing sport.",
    "version": 3,
    "created_at": "2025-08-31 22:35:01.410104",
    "updated_at": "2025-08-31 22:35:01.410104",
    "metrics_meaningbert": 0.7687,
    "metrics_cefr_compliance": "B1"
  }
}