{
  "text": {
    "id": "a86e85ff-0760-4eb8-9347-f7653fbd955d",
    "cefr_level": "A2",
    "text_id": "text_001",
    "text_translated": "The Hunger Games is an event every year. The Capitol uses this event to remind the areas they are punished for their fight against the Capitol.\nEvery year, people choose one boy and one girl. They are 12 to 18 years old. They come from each area. People choose them by chance. These young people are called 'tributes'. The tributes fight. Only one person lives. The Capitol makes everyone in the country watch the event on TV.",
    "version": 16,
    "created_at": "2025-08-31 22:38:37.425309",
    "updated_at": "2025-08-31 22:38:37.425310",
    "metrics_meaningbert": null,
    "metrics_cefr_compliance": null
  },
  "feedback": {
    "id": "0e1424ef-6191-4a3d-b193-d66f3783f66c",
    "approval": "FAIL",
    "grade": 3,
    "feedback": "FAIL: Meaning Preservation Failure. The MeaningBERT score of 0.714 is below the required 0.75. The core meaning of the original text was not fully preserved. The original text emphasizes that the tributes 'compete in a battle', highlighting a structured, deadly competition. Your version simplifies this to 'The tributes fight', which loses the specific nuance of a formal competition. The word 'compete' and the concept of a 'battle' as a structured event are crucial to the original message and were not adequately conveyed. Suggestion: Rephrase the sentence to explicitly include the idea of a deadly competition or contest.",
    "metrics": {
      "cefr_compliance": "A2",
      "bertscore": 0.9298,
      "meaningbert": 0.714
    },
    "created_at": "2025-08-31 22:38:50.421162"
  },
  "attempt_number": 16,
  "best_attempt": {
    "id": "e4260f79-3c8b-4f28-bb54-86e2769afca5",
    "cefr_level": "A2",
    "text_id": "text_001",
    "text_translated": "The Hunger Games is an event. It happens every year. The Capitol uses this event to make the areas remember their punishment. This is because the areas fought against the Capitol.\nEvery year, people choose one boy and one girl. They are 12 to 18 years old. They come from each area. People choose them by chance. These young people are called 'tributes'. The tributes fight. Only one person lives. The Capitol makes everyone in the country watch the event on TV.",
    "version": 10,
    "created_at": "2025-08-31 22:36:29.490925",
    "updated_at": "2025-08-31 22:36:29.490926",
    "metrics_meaningbert": 0.7573,
    "metrics_cefr_compliance": "A2"
  }
}