{
  "text": {
    "id": "ffbe0cef-822d-4782-a037-e9a2d92c1340",
    "cefr_level": "A2",
    "text_id": "text_001",
    "text_translated": "Wild animals often come into cities to look for food. In Cape Town, South Africa, baboons started to come to houses at the side of the city to eat. They open rubbish bins and eat fruit from gardens and places with fruit trees. Some baboons are very brave. They go into people's houses and take food from kitchen cupboards and fridges. Baboons can fight. They attack many pet animals. So, people do not want them there.",
    "version": 11,
    "created_at": "2025-09-01 17:01:24.023020",
    "updated_at": "2025-09-01 17:01:24.023031",
    "metrics_meaningbert": null,
    "metrics_cefr_compliance": null
  },
  "feedback": {
    "id": "0a5d6b0f-56d7-4a35-a938-cf5d06d6139a",
    "approval": "FAIL",
    "grade": 3,
    "feedback": "FAIL: Meaning Preservation Failure. The MeaningBERT score of 0.6792 is below the required threshold of approximately 0.75. This indicates a failure to preserve the core message and its nuances. The original text explicitly states that the residents' unwelcoming attitude is 'understandably' due to the baboons' aggressive behavior and attacks on pet animals. Your version simplifies this to 'So, people do not want them there', which loses the crucial nuance of the residents' justified reaction and the specific, more formal phrasing 'don't welcome their presence'. The simplification diminishes the depth of the original message. Suggestion: Rephrase the final sentence to more accurately reflect the 'understandable' nature of the residents' feelings and their specific 'unwelcoming' stance, rather than a simple 'do not want them there'.",
    "metrics": {
      "cefr_compliance": "A2",
      "bertscore": 0.9575,
      "meaningbert": 0.6792
    },
    "created_at": "2025-09-01 17:01:42.867032"
  },
  "attempt_number": 11,
  "best_attempt": {
    "id": "2cc36e15-f4f0-40b8-bc80-c4ac627fc1c6",
    "cefr_level": "A2",
    "text_id": "text_001",
    "text_translated": "Wild animals often come into cities to look for food. In Cape Town, South Africa, baboons started to come to houses at the side of the city to eat. They open rubbish bins and eat fruit from gardens and orchards. Some baboons are very brave. They go into people's houses and take food from kitchen cupboards and fridges. Baboons can fight. They attack many pet animals. So, people do not want them there.",
    "version": 10,
    "created_at": "2025-09-01 17:01:05.212599",
    "updated_at": "2025-09-01 17:01:05.212600",
    "metrics_meaningbert": 0.78,
    "metrics_cefr_compliance": "A2"
  }
}