{
  "text": {
    "id": "0d91e497-71e0-4c9c-b123-134d84db9e10",
    "cefr_level": "A2",
    "text_id": "text_001",
    "text_translated": "The first plan is a test called DART (Double Asteroid Redirection Test). Scientists will test DART on the moon of an asteroid called Didymos. The moon's name is 'Didymoon' and it is 150 metres wide. It moves in an orbit around the bigger 800-metre asteroid. DART will hit Didymoon. Scientists hope the hit will change its path enough for telescopes on Earth to see. An orbit is a path in space where a small thing moves around a big thing.",
    "version": 6,
    "created_at": "2025-09-01 10:37:49.041395",
    "updated_at": "2025-09-01 10:37:49.041399",
    "metrics_meaningbert": null,
    "metrics_cefr_compliance": null
  },
  "feedback": {
    "id": "7c3a7c86-556c-408f-8f05-51e86fefca94",
    "approval": "FAIL",
    "grade": 3,
    "feedback": "FAIL: Meaning Preservation Failure. The MeaningBERT score of 0.5857 is significantly below the required 0.75 threshold. This indicates a failure to preserve the core message of the original text.\n\n- Primary Deviation: The original text describes a forceful action: the DART test will 'knock it out of its orbit'. Your version weakens this core concept to 'change its path'. This loss of semantic weight is a critical failure in preserving the original meaning.\n- Structural Deviation: The sentence 'Scientists hope the hit will change its path enough for telescopes on Earth to see' uses a complex structure ('hope... enough for... to see') that is above the A2 level.\n- Grammatical Deviation: The definition 'An orbit is a path in space where a small thing moves around a big thing' uses a defining relative clause with 'where'. This is a B1 grammatical structure and is not compliant with the A2 standard.\n\nSuggestion: Rephrase to restore the original's meaning of a strong impact. Use simpler verbs like 'push' instead of 'change'. Split the complex sentences. The definition for 'orbit' must be rewritten using two simple sentences without a 'where' clause.",
    "metrics": {
      "cefr_compliance": "A2",
      "bertscore": 0.9313,
      "meaningbert": 0.5857
    },
    "created_at": "2025-09-01 10:38:13.811032"
  },
  "attempt_number": 6,
  "best_attempt": {
    "id": "0d91e497-71e0-4c9c-b123-134d84db9e10",
    "cefr_level": "A2",
    "text_id": "text_001",
    "text_translated": "The first plan is a test called DART (Double Asteroid Redirection Test). Scientists will test DART on the moon of an asteroid called Didymos. The moon's name is 'Didymoon' and it is 150 metres wide. It moves in an orbit around the bigger 800-metre asteroid. DART will hit Didymoon. Scientists hope the hit will change its path enough for telescopes on Earth to see. An orbit is a path in space where a small thing moves around a big thing.",
    "version": 6,
    "created_at": "2025-09-01 10:37:49.041395",
    "updated_at": "2025-09-01 10:37:49.041399",
    "metrics_meaningbert": 0.5857,
    "metrics_cefr_compliance": "A2"
  }
}