{
  "text": {
    "id": "b8431588-48b1-43fa-b729-11e57bb91864",
    "cefr_level": "A2",
    "text_id": "text_001",
    "text_translated": "A new idea is here. It is called 'buy nothing'. This idea is now with people on social media. These people usually show clothes and make-up. They tell people to buy these things.\n\nNow, some YouTube stars tell people to buy nothing. They say 'buy nothing' for a whole year. Two friends in Canada did this. They did it for one year. They only bought food.\n\nFor three months, they learned to live. They did not buy electric things. They did not buy clothes. They did not buy things for their house. Next, they stopped buying services. For example, no haircuts. No eating in restaurants. No gas for cars. In one year, they saved $55,000.",
    "version": 2,
    "created_at": "2025-09-01 16:58:26.875273",
    "updated_at": "2025-09-01 16:58:26.875276",
    "metrics_meaningbert": null,
    "metrics_cefr_compliance": null
  },
  "feedback": {
    "id": "77103ee7-6bff-4bab-8d78-a129e2def08d",
    "approval": "PASS",
    "grade": 10,
    "feedback": "PASS: The text successfully meets all A2 CEFR readability standards. It maintains factual integrity, preserves the original meaning and fidelity, and is classified as A2 by the CEFR classifier. The vocabulary is appropriate for A2, with no complex words detected. Sentence structures are consistently short and simple, using basic conjunctions implicitly or through sentence breaks. This is a well-executed simplification.",
    "metrics": {
      "cefr_compliance": "A2",
      "bertscore": 0.9147,
      "meaningbert": 0.8508
    },
    "created_at": "2025-09-01 16:58:37.022957"
  },
  "attempt_number": 2,
  "best_attempt": {
    "id": "c2e5d9d7-25ab-4e62-a0a5-58ae5b5e0e9e",
    "cefr_level": "A2",
    "text_id": "47-a2",
    "text_translated": "A new idea is here. It is called 'buy nothing'. This idea is now with people on social media. These people usually show clothes and make-up. They tell people to buy these things.\n\nNow, some YouTube stars tell people to buy nothing. They say 'buy nothing' for a whole year. Two friends in Canada did this. They did it for one year. They only bought food.\n\nFor three months, they learned to live. They did not buy electric things. They did not buy clothes. They did not buy things for their house. Next, they stopped buying services. For example, no haircuts. No eating in restaurants. No car fuel. In one year, they saved $55,000.",
    "version": 1,
    "created_at": "2025-09-01 16:58:15.579439",
    "updated_at": "2025-09-01 16:58:15.579450",
    "metrics_meaningbert": 0.8514,
    "metrics_cefr_compliance": "A2"
  }
}