{
  "text": {
    "id": "ba4c3933-22b8-4d3d-b867-0ef7271c498e",
    "cefr_level": "A2",
    "text_id": "text_001",
    "text_translated": "The Hunger Games is an event every year. The Capitol uses the games to show the areas they did something wrong. This is because the areas fought against the Capitol in the past. Every year, each area chooses one boy and one girl. They are between 12 and 18 years old. They choose the names without looking. They must compete in a big fight. Only one person can live. The young people in the game have a special name. They are called \"tributes\". Everyone in the country must watch the event on TV.",
    "version": 11,
    "created_at": "2025-08-31 20:39:10.993119",
    "updated_at": "2025-08-31 20:39:10.993122",
    "metrics_meaningbert": null,
    "metrics_cefr_compliance": null
  },
  "feedback": {
    "id": "72532233-1cca-4a8a-b639-b400406b1ec1",
    "approval": "FAIL",
    "grade": 3,
    "feedback": "FAIL: Meaning Preservation Failure. The MeaningBERT score of 0.7062 is below the required 0.75 threshold. This indicates a critical failure to preserve the core message of the original text.\n\n- The original text states the games are a 'punishment' for 'rebelling'. Your version, 'show the areas they did something wrong', is too weak and loses the core meaning of punishment and control. The semantic weight is lost.\n- The original states the nation is 'forced to watch'. Your version, 'must watch', softens this meaning. The concept of coercion is a key part of the original message and has been diluted.\n\nSuggestion: Rephrase to restore the original meaning. The concept of 'punishment' is central and must be included. Use a simple sentence like, 'The Capitol uses the games to punish the areas.' Restore the concept of 'force' by stating, 'Everyone in the country is forced to watch the event on TV.'",
    "metrics": {
      "cefr_compliance": "A2",
      "bertscore": 0.9225,
      "meaningbert": 0.7062
    },
    "created_at": "2025-08-31 20:39:36.987160"
  },
  "attempt_number": 11,
  "best_attempt": {
    "id": "619eb956-cd45-4f4a-a737-f31fe58abc8f",
    "cefr_level": "A2",
    "text_id": "text_001",
    "text_translated": "The Hunger Games is an event every year. The Capitol uses the games to remind the areas about a past fight. The areas fought against the Capitol and lost. Every year, each area chooses one boy and one girl. They are between 12 and 18 years old. They choose the names without looking. They must compete in a big fight. Only one person can live. The teenagers in the game have a special name. They are called \"tributes\". Everyone in the country must watch the event on TV.",
    "version": 8,
    "created_at": "2025-08-31 20:37:17.791942",
    "updated_at": "2025-08-31 20:37:17.791950",
    "metrics_meaningbert": 0.8216,
    "metrics_cefr_compliance": "A2"
  }
}