{
  "text": {
    "id": "45d926c5-9030-4d84-9ba0-7815d7b89996",
    "cefr_level": "B1",
    "text_id": "text_001",
    "text_translated": "Most kinds of spiders have **venom**, which is a poisonous liquid. Its purpose is to stun or kill the animals they hunt, and not to attack people. In fact, only 25 known kinds of spiders produce venom that can really harm humans. Although their bites can be painful, they are not often deadly. For example, Australia's Sydney funnel-web spider, which is famous because it is dangerous, has not killed anyone since an anti-venom was developed in 1981.\n\nHowever, you should be careful not to make hairy spiders, like tarantulas, angry. When they feel they are in danger, they protect themselves by sending out a cloud of **urticating hairs**, which are irritating hairs. These hairs then stick into the skin or eyes of the attacker.",
    "version": 11,
    "created_at": "2025-09-01 17:31:37.736816",
    "updated_at": "2025-09-01 17:31:37.736827",
    "metrics_meaningbert": null,
    "metrics_cefr_compliance": null
  },
  "feedback": {
    "id": "45bbab10-114b-46bd-9edf-2e440bcd5329",
    "approval": "FAIL",
    "grade": 5,
    "feedback": "FAIL: CEFR Compliance. The text was classified as 'B2', which is above the required 'B1' level. While the text successfully preserved factual integrity and meaning (MeaningBERT: 0.7968, BERTScore: 0.9318), the sentence structures are too complex for a B1 target audience. For instance, the sentence 'For example, Australia's Sydney funnel-web spider, which is famous because it is dangerous, has not killed anyone since an anti-venom was developed in 1981' is quite long and contains a non-defining relative clause that itself includes a causal explanation, making it more suitable for a B2 reader. Similarly, the sentence 'When they feel they are in danger, they protect themselves by sending out a cloud of urticating hairs, which are irritating hairs' combines a temporal clause with a non-defining relative clause, increasing its complexity. To achieve a B1 level, consider splitting these longer sentences into two or more simpler sentences. For example, 'Australia's Sydney funnel-web spider is famous because it is dangerous. For example, it has not killed anyone since an anti-venom was developed in 1981.' Also, some non-defining relative clauses could be rephrased as separate explanatory sentences to reduce sentence load. The definitions for 'venom' and 'urticating hairs' were well-executed and appropriate for B1.",
    "metrics": {
      "cefr_compliance": "B2",
      "bertscore": 0.9318,
      "meaningbert": 0.7968
    },
    "created_at": "2025-09-01 17:31:57.771091"
  },
  "attempt_number": 11,
  "best_attempt": {
    "id": "1adf9062-fec9-4d54-b7af-e76f729907ba",
    "cefr_level": "B1",
    "text_id": "text_001",
    "text_translated": "Most kinds of spiders have **venom**, which is a poisonous liquid. Its purpose is to stun or kill the animals they hunt, and not to attack people. In fact, only 25 known kinds of spiders produce venom that can really harm humans. Although their bites can be painful, they are not often deadly. For example, Australia's Sydney funnel-web spider, which is famous for being dangerous, has not killed anyone since an anti-venom was developed in 1981.\n\nHowever, you should be careful not to make hairy spiders, like tarantulas, angry. When they feel they are in danger, they protect themselves by sending out a cloud of **urticating hairs**, which are irritating hairs. These hairs then stick into the skin or eyes of the attacker.",
    "version": 10,
    "created_at": "2025-09-01 17:31:18.091538",
    "updated_at": "2025-09-01 17:31:18.091550",
    "metrics_meaningbert": 0.8056,
    "metrics_cefr_compliance": "B2"
  }
}