{
  "text": {
    "id": "f2a06201-0fe4-4974-a3d1-d1e4f7014e99",
    "cefr_level": "B1",
    "text_id": "text_001",
    "text_translated": "The first is DART. This means Double Asteroid Redirection Test. An asteroid is a large space rock. Plans are scheduled to test DART on the moon of an asteroid called Didymos. 'Didymoon' is 150 metres wide. It orbits its 800-metre mother asteroid. Hopefully, the impact of DART will knock it out of its orbit. Earth-based telescopes should then be able to see this change.",
    "version": 11,
    "created_at": "2025-09-01 17:28:44.313325",
    "updated_at": "2025-09-01 17:28:44.313325",
    "metrics_meaningbert": null,
    "metrics_cefr_compliance": null
  },
  "feedback": {
    "id": "c55532f1-629b-4fc9-b709-5b882fb48f3c",
    "approval": "FAIL",
    "grade": 4,
    "feedback": "FAIL: CEFR Compliance. The text was classified as 'B2', which is too complex for the target B1 level. The primary reason for this classification is the use of the word 'means' in the sentence 'This means Double Asteroid Redirection Test'. According to the provided vocabulary candidates, 'means' is a B2-level word. To achieve B1 compliance, this should be replaced with a simpler alternative. For example, 'This stands for Double Asteroid Redirection Test' or 'DART is short for Double Asteroid Redirection Test' would be more appropriate for a B1 audience. Additionally, while the sentence structure was simplified effectively, the overall density of scientific vocabulary such as 'scheduled', 'impact', 'orbit', and 'telescopes' might collectively contribute to a higher perceived complexity, even if individually these words can appear at B1. Reviewing these terms for potential simplification or rephrasing could further solidify the text at the B1 level.",
    "metrics": {
      "cefr_compliance": "B2",
      "bertscore": 0.9641,
      "meaningbert": 0.9447
    },
    "created_at": "2025-09-01 17:29:08.758891"
  },
  "attempt_number": 11,
  "best_attempt": {
    "id": "5bc04199-cf66-4cfb-9236-bfc8782135ba",
    "cefr_level": "B1",
    "text_id": "text_001",
    "text_translated": "The first project is called DART, which stands for Double Asteroid Redirection Test. People plan to test DART on the moon of an asteroid, which is a rock that travels in space. This asteroid is called Didymos. Its moon is called 'Didymoon', and it is 150 metres wide. 'Didymoon' goes around its bigger asteroid, which is 800 metres wide. We hope that when DART hits it, the hit will push it away from its path around the bigger asteroid, so that telescopes on Earth can detect the change in its orbit.",
    "version": 2,
    "created_at": "2025-09-01 17:22:58.118576",
    "updated_at": "2025-09-01 17:22:58.118576",
    "metrics_meaningbert": 0.6602,
    "metrics_cefr_compliance": "B1"
  }
}