{
  "text": {
    "id": "98e70538-b51f-493c-8b64-009b3e44b4c8",
    "cefr_level": "A2",
    "text_id": "text_001",
    "text_translated": "Asteroids are small rocks in space. NASA can find the other middle-sized asteroids. But they can only do this if they get money. They need money to build a 0.5-metre space telescope called NEOCam. This telescope will use infrared light. Infrared light is a special light. People cannot see it. If NASA gets the money, it will take about ten years. After they find the asteroids, a team has a job. They must think about how to protect our planet. They need to stop dangerous asteroids from hitting it.",
    "version": 5,
    "created_at": "2025-09-01 10:33:51.126500",
    "updated_at": "2025-09-01 10:33:51.126538",
    "metrics_meaningbert": null,
    "metrics_cefr_compliance": null
  },
  "feedback": {
    "id": "edab6958-2b5d-45c4-9f5c-946015e6655e",
    "approval": "PASS",
    "grade": 10,
    "feedback": "PASS: The text fully complies with all A2 standards.\n\n- Factual Integrity: The output accurately preserves all key facts from the original text, including the name of the telescope (NEOCam), its size (0.5-metre), the use of infrared light, the ten-year timeline, and the ultimate goal of planetary defense.\n- Metrics Compliance: All metrics are well within the required ranges. The MeaningBERT score of 0.7964 and BERTScore of 0.9124 confirm high fidelity to the original message. The CEFR classifier correctly identifies the text as A2.\n- Vocabulary Control: The vocabulary is strictly A2. The potentially complex term 'infrared' is correctly handled by providing a simple, A2-level explanation: \"Infrared light is a special light. People cannot see it.\"\n- Structural Simplicity: The text uses short, simple sentences. Connectors are limited to basic A2 forms ('but', 'if', 'after'). The overall structure is clear and easy for an A2 reader to follow.\n- Keyword Definition: The provided definition for 'asteroids' (\"Asteroids are small rocks in space\") is a model of A2 simplicity and accuracy.",
    "metrics": {
      "cefr_compliance": "A2",
      "bertscore": 0.9124,
      "meaningbert": 0.7964
    },
    "created_at": "2025-09-01 10:34:17.450092"
  },
  "attempt_number": 5,
  "best_attempt": {
    "id": "01d66e86-b92b-4cf8-b4d0-54774e3a838f",
    "cefr_level": "A2",
    "text_id": "text_001",
    "text_translated": "Asteroids are small rocks in space. NASA wants to find the other middle-sized asteroids. But they need money for this. They want to build a telescope called NEOCam. This telescope will use infrared light. Infrared light is a light people cannot see. If NASA gets the money, they can do this. It will take about ten years. After they find the asteroids, a special team needs a plan. This is the planetary defence team. The plan is to protect our planet from dangerous asteroids.",
    "version": 2,
    "created_at": "2025-09-01 10:31:51.367817",
    "updated_at": "2025-09-01 10:31:51.367830",
    "metrics_meaningbert": 0.8185,
    "metrics_cefr_compliance": "A2"
  }
}