{
  "text": {
    "id": "180b8d1d-552b-4a57-a61a-1d8ec1ed0b08",
    "cefr_level": "A2",
    "text_id": "text_001",
    "text_translated": "The Hunger Games are a big event. They happen every year. The Games are a battle in which only one person can survive. The Capitol uses the Games to remind the districts. It reminds them they are punished for rebelling. In each district, they choose by lottery. They choose one boy and one girl. They are 12 to 18 years old. People call them “tributes”. Tributes are the teenagers in the Games. All people in the country must watch on television.",
    "version": 5,
    "created_at": "2025-08-31 23:35:39.906366",
    "updated_at": "2025-08-31 23:35:39.906374",
    "metrics_meaningbert": null,
    "metrics_cefr_compliance": null
  },
  "feedback": {
    "id": "57b6981a-0fc8-4cd6-8278-f78b4ce6d1e2",
    "approval": "FAIL",
    "grade": 3,
    "feedback": "FAIL: CEFR Compliance. Classifier rated B1. The text uses B1 level vocabulary such as battle, survive, remind, district, lottery which are not in A2. The sentence “The Games are a battle in which only one person can survive.” uses the relative clause “in which,” a B1 grammar structure. Suggestion: Replace battle with fight, survive with win, lottery with draw, district with area. Remove the phrase “in which.” Use only A2 words. Keep sentences no more than five words long and use only and, but, so, because as connectors.",
    "metrics": {
      "cefr_compliance": "B1",
      "bertscore": 0.9357,
      "meaningbert": 0.8903
    },
    "created_at": "2025-08-31 23:35:57.715464"
  },
  "attempt_number": 5,
  "best_attempt": {
    "id": "63f71ffd-cb49-4ab8-9e50-3aaa3a9280e4",
    "cefr_level": "A2",
    "text_id": "text_001",
    "text_translated": "The Hunger Games are a very dangerous event. They happen every year. People watch them on TV. The Capitol uses the Games to remind the districts. The districts rebelled before. The Games are their punishment. In each district, a lottery picks one boy and one girl. They are 12 to 18 years old. These teenagers are \"tributes\". \"Tributes\" means the teenagers in the Games. The tributes fight in the Games. Only one person stays alive. All people in the country must watch on TV.",
    "version": 2,
    "created_at": "2025-08-31 23:31:42.257191",
    "updated_at": "2025-08-31 23:31:42.257203",
    "metrics_meaningbert": 0.796,
    "metrics_cefr_compliance": "A2"
  }
}