{
  "text": {
    "id": "3ca911b0-1bc5-4fb8-a1af-271382abfc52",
    "cefr_level": "B1",
    "text_id": "text_001",
    "text_translated": "**Asteroids** are rocks that fly through space. Some are called 'Dangerous Asteroids'. This is because they pass very close to Earth's orbit, within 7.5 million kilometres. NASA has created a map of 1,400 of these asteroids, but it does not expect any of them to be a threat in the next one hundred years. NASA already has the technology for this. It can track these objects and predict a possible impact. If NASA predicts an impact, it could launch two defence solutions.",
    "version": 6,
    "created_at": "2025-09-01 01:11:17.163891",
    "updated_at": "2025-09-01 01:11:17.163895",
    "metrics_meaningbert": null,
    "metrics_cefr_compliance": null
  },
  "feedback": {
    "id": "7c9d5e80-c9d6-4443-94da-3c03d2c3cefb",
    "approval": "FAIL",
    "grade": 4,
    "feedback": "FAIL: CEFR Compliance. The text was classified as 'B2', which is too complex for the target 'B1' level. The likely cause is the use of long, complex sentences. For example, the sentence 'NASA has created a map of 1,400 of these asteroids, but it does not expect any of them to be a threat in the next one hundred years' combines two distinct ideas. To correct this and meet the B1 requirement, split this into two simpler sentences, such as: 'NASA has created a map of 1,400 of these asteroids. However, NASA does not expect any of them to be a threat in the next 100 years.' On a positive note, the submission successfully maintained factual integrity and preserved the original meaning, as shown by the high BERTScore and MeaningBERT scores.",
    "metrics": {
      "cefr_compliance": "B2",
      "bertscore": 0.9303,
      "meaningbert": 0.8833
    },
    "created_at": "2025-09-01 01:11:39.959738"
  },
  "attempt_number": 6,
  "best_attempt": {
    "id": "66560444-c376-4ce0-8ae2-347cdce284c3",
    "cefr_level": "B1",
    "text_id": "text_001",
    "text_translated": "**Asteroids** are rocks that fly through space. They are called 'Potentially Hazardous' if they are close enough to pass within 7.5 million kilometres of Earth's orbit. NASA has created a map of 1,400 of these asteroids, but none of them are expected to be a threat in the next one hundred years. With technology that is already available, NASA can track these objects and make predictions about a possible impact. If an impact is predicted, two defence solutions could be launched.",
    "version": 2,
    "created_at": "2025-09-01 01:08:21.332526",
    "updated_at": "2025-09-01 01:08:21.332538",
    "metrics_meaningbert": 0.9296,
    "metrics_cefr_compliance": "B2"
  }
}