{
  "text": {
    "id": "46b6b693-0b37-4c53-99de-f05cb077796d",
    "cefr_level": "B1",
    "text_id": "text_001",
    "text_translated": "NASA needs funding to find the remaining middle‑sized near‑Earth objects. The money would be used to build NEOCam, a 0.5‑metre infrared space telescope. If the funding is approved, the project could reach its goal in ten years. After the asteroids are logged, the planetary defence team must determine how to protect the planet. They need to focus on the most dangerous asteroids, called PHAs.",
    "version": 11,
    "created_at": "2025-09-01 17:41:28.483629",
    "updated_at": "2025-09-01 17:41:28.483635",
    "metrics_meaningbert": null,
    "metrics_cefr_compliance": null
  },
  "feedback": {
    "id": "9c28777b-b7fc-4ebf-ac8c-6cf400201e9c",
    "approval": "FAIL",
    "grade": 4,
    "feedback": "FAIL: CEFR Compliance. The text was classified as 'B2', which is too complex for the target B1 level. This is likely due to the repeated use of the passive voice ('would be used', 'is approved', 'are logged') and formal vocabulary such as 'determine'. To correct this, rewrite sentences using the active voice. For example, 'The team would use the money to build NEOCam...' and 'After the team logs the asteroids...'. Consider replacing 'determine' with a simpler B1 alternative like 'decide' or 'work out'. On a positive note, the submission is factually accurate and successfully preserves the original meaning, as shown by the high MeaningBERT and BERTScore metrics.",
    "metrics": {
      "cefr_compliance": "B2",
      "bertscore": 0.9333,
      "meaningbert": 0.9452
    },
    "created_at": "2025-09-01 17:41:50.264542"
  },
  "attempt_number": 11,
  "best_attempt": {
    "id": "fef4c054-87cc-44dd-9dc7-60213faf28e8",
    "cefr_level": "B1",
    "text_id": "text_001",
    "text_translated": "To find the remaining middle‑sized near‑Earth objects, NASA needs money to build NEOCam. NEOCam, a 0.5‑metre infrared space telescope, can detect asteroids. If the funding is approved, the project could probably achieve its goal in ten years. Once the asteroids are logged, the planetary defence team would still have to work out how to defend the planet against the truly worrying asteroids, the PHAs.",
    "version": 4,
    "created_at": "2025-09-01 17:38:03.724906",
    "updated_at": "2025-09-01 17:38:03.724932",
    "metrics_meaningbert": 0.9452,
    "metrics_cefr_compliance": "A2"
  }
}