{
  "text": {
    "id": "df4657c6-57f3-4d6f-900f-264e54e0aacb",
    "cefr_level": "A2",
    "text_id": "text_001",
    "text_translated": "Influencers on social media show clothes and make‑up and tell people to buy them. Some influencers ask viewers not to buy anything for a whole year.  \nTwo friends in Canada spent a year working to buy only food.  \nIn three months they stopped buying electrical items, clothes and home items.  \nThen they stopped paying for services. They stopped haircuts, eating out and petrol for their cars.  \nIn one year they saved $55,000.",
    "version": 9,
    "created_at": "2025-09-01 17:16:53.954432",
    "updated_at": "2025-09-01 17:16:53.954435",
    "metrics_meaningbert": null,
    "metrics_cefr_compliance": null
  },
  "feedback": {
    "id": "a8942ffd-78f5-43d7-8eaa-ff885a6e1bd2",
    "approval": "PASS",
    "grade": 10,
    "feedback": "PASS: The text successfully meets all A2 criteria.\n\n- Factual Integrity: Confirmed. All key information, including the savings amount of $55,000 and the timeline, is correct.\n- Meaning and Fidelity: The MeaningBERT score of 0.85 and BERTScore of 0.91 are well above the required thresholds. The core message is perfectly preserved.\n- CEFR Compliance: The text correctly classifies as A2. The linguistic features align perfectly with the target level.\n- Qualitative Audit: The vocabulary is strictly limited to A1 and A2 levels. Sentence structures are simple, short, and clear, using basic connectors appropriate for the A2 level. This is a model A2 text. No corrections are required.",
    "metrics": {
      "cefr_compliance": "A2",
      "bertscore": 0.9127,
      "meaningbert": 0.8536
    },
    "created_at": "2025-09-01 17:17:17.123352"
  },
  "attempt_number": 9,
  "best_attempt": {
    "id": "44c342e0-3631-43b3-8bf0-72e688219b9e",
    "cefr_level": "A2",
    "text_id": "47-a2",
    "text_translated": "The 'buy nothing' idea is now on online sites.  \nFamous people on online sites often show clothes.  \nThey also show makeup they suggest to buy.  \nSome video stars now ask their watchers not to buy anything.  \nThey ask this for a whole year.  \nTwo friends in Canada spent a year trying to buy only food.  \nIn three months they learned to live without buying electric things.  \nLater they also stopped buying clothes or home items.  \nFor the next step they stopped services like haircuts.  \nThey also stopped eating at restaurants.  \nThey stopped buying gas for their cars.  \nIn one year they saved $55,000.",
    "version": 1,
    "created_at": "2025-09-01 17:12:13.308721",
    "updated_at": "2025-09-01 17:12:13.308725",
    "metrics_meaningbert": 0.8587,
    "metrics_cefr_compliance": "A2"
  }
}