{
  "text": {
    "id": "4d6d280c-75b5-4fd3-ac5c-6d8d85fda3a5",
    "cefr_level": "A2",
    "text_id": "text_001",
    "text_translated": "Wasfia decided to spend her whole life supporting human rights. Human rights mean every person should be safe and free. She saw projects from other countries come to teach women and girls. But these projects often stopped. When the projects stopped, the women had nothing. This showed Wasfia a big problem. She knew Bangladesh needed to help itself. So she brought her two passions together to make a change. She loved climbing mountains and human rights. She wanted to change how people think about women. She started climbing when she was working on projects in Tibet and Nepal. Her country, Bangladesh, is very flat and near the sea. Most people there have never seen a mountain. So climbing gets people's attention. Her idea is working. People in Bangladesh are paying attention. And people in other countries are paying attention too.",
    "version": 6,
    "created_at": "2025-09-01 10:44:18.578205",
    "updated_at": "2025-09-01 10:44:18.578215",
    "metrics_meaningbert": null,
    "metrics_cefr_compliance": null
  },
  "feedback": {
    "id": "2fbeb0d6-19da-4d8f-ba52-d2baf3a8bcce",
    "approval": "FAIL",
    "grade": 3,
    "feedback": "FAIL: Meaning Preservation Failure. The MeaningBERT score of 0.6628 is significantly below the required 0.75 threshold. This indicates a critical failure to preserve the core message of the original text.\n\n*   Core Meaning Lost: The original text describes a 'campaign' that causes people to 'sit up and take notice'. Your version weakens this to an 'idea' that makes people 'pay attention'. This change loses the sense of an organized, impactful effort, which is central to the original text's meaning.\n*   Weakened Causality: The original text explicitly links her passions to her goal: 'in order to try and change attitudes'. Your version separates these concepts, weakening the cause-and-effect relationship.\n*   Fidelity vs. Meaning: While the BERTScore of 0.9112 shows you used similar words, the low MeaningBERT score proves that the arrangement of those words failed to convey the same message.\n\nSuggestion: Restore the concept of an organized effort. Replace 'idea' with a stronger A2 phrase like 'special project' or 'important work'. Rephrase to show that her climbing was the specific method used to make people listen to her message about women's rights.",
    "metrics": {
      "cefr_compliance": "A2",
      "bertscore": 0.9112,
      "meaningbert": 0.6628
    },
    "created_at": "2025-09-01 10:44:46.252028"
  },
  "attempt_number": 6,
  "best_attempt": {
    "id": "880d347e-1d9c-49c2-984b-66db3e59b8dd",
    "cefr_level": "A2",
    "text_id": "text_001",
    "text_translated": "Wasfia works hard to support human rights in her country. Human rights are important. Every person should have them. For example, every person should be safe and free.\nShe saw projects from other countries come to help women and girls. But these projects often stopped. When the projects stopped, the women had nothing. This showed Wasfia a big problem. She knew Bangladesh needed to help itself. So she brought her two passions together to make a change. She loved climbing mountains and human rights. She wanted to change how people think about women.\nShe started climbing when she was working on projects in Tibet and Nepal. Her country, Bangladesh, is very flat and near the sea. Most people there have never seen a mountain.\nSo climbing gets people's attention. Her idea is working. People in Bangladesh are paying attention. And people in other countries are paying attention too.",
    "version": 5,
    "created_at": "2025-09-01 10:43:32.733697",
    "updated_at": "2025-09-01 10:43:32.733749",
    "metrics_meaningbert": 0.6757,
    "metrics_cefr_compliance": "A2"
  }
}