{
  "text": {
    "id": "b84bd4f0-939c-48b2-a888-15b74abb1719",
    "cefr_level": "B1",
    "text_id": "text_001",
    "text_translated": "Zoos have an important modern job: supporting international breeding programmes, especially for species (kinds of animals) that are in danger of disappearing. In the wild, some of the rarest species (kinds of animals) find it difficult to get partners and have babies. They might also be in danger from poachers, losing their homes, and other animals that hunt them. A good zoo will let these species (kinds of animals) live and have babies in a safe place. In addition, when the number of some wild species (kinds of animals) drops, there is a bigger danger. The animals in these groups can become too similar because they have very similar genes. Breeding programmes give them protection. Animals born in zoos can be put back into the wild, which helps to make the groups have more different genes.",
    "version": 5,
    "created_at": "2025-09-01 17:25:31.303728",
    "updated_at": "2025-09-01 17:25:31.303729",
    "metrics_meaningbert": null,
    "metrics_cefr_compliance": null
  },
  "feedback": {
    "id": "8a0aed11-a41b-4890-906c-4f0a34080384",
    "approval": "PASS",
    "grade": 10,
    "feedback": "The text successfully passes all priority checks. Factual integrity is perfectly maintained, with no discrepancies between the original and simplified versions. Both MeaningBERT (0.7584) and BERTScore (0.919) exceed the required thresholds, indicating excellent preservation of meaning and fidelity to the original content. The CEFR classifier correctly identified the output as B1, demonstrating appropriate linguistic complexity for the target audience. Qualitatively, the simplification is outstanding. The writer consistently and effectively defined the keyword 'species' as 'kinds of animals' throughout the text, which is a best practice for B1 learners. Complex phrases like 'populations becoming too genetically similar' were skillfully rephrased into more accessible language such as 'The animals in these groups can become too similar because they have very similar genes,' enhancing clarity without losing meaning. Sentence structures were appropriately simplified, and the overall flow is natural and easy to follow. This is an exemplary simplification that meets all requirements.",
    "metrics": {
      "cefr_compliance": "B1",
      "bertscore": 0.919,
      "meaningbert": 0.7584
    },
    "created_at": "2025-09-01 17:25:51.111168"
  },
  "attempt_number": 5,
  "best_attempt": {
    "id": "b84bd4f0-939c-48b2-a888-15b74abb1719",
    "cefr_level": "B1",
    "text_id": "text_001",
    "text_translated": "Zoos have an important modern job: supporting international breeding programmes, especially for species (kinds of animals) that are in danger of disappearing. In the wild, some of the rarest species (kinds of animals) find it difficult to get partners and have babies. They might also be in danger from poachers, losing their homes, and other animals that hunt them. A good zoo will let these species (kinds of animals) live and have babies in a safe place. In addition, when the number of some wild species (kinds of animals) drops, there is a bigger danger. The animals in these groups can become too similar because they have very similar genes. Breeding programmes give them protection. Animals born in zoos can be put back into the wild, which helps to make the groups have more different genes.",
    "version": 5,
    "created_at": "2025-09-01 17:25:31.303728",
    "updated_at": "2025-09-01 17:25:31.303729",
    "metrics_meaningbert": 0.7584,
    "metrics_cefr_compliance": "B1"
  }
}