{
  "text": {
    "id": "00cc23f0-3d68-4ae2-91fd-3ba4e60ef215",
    "cefr_level": "A2",
    "text_id": "text_001",
    "text_translated": "Business means when people or companies sell things or services to others. Culture means the ideas, habits, and ways of a group of people. Communication means how people share ideas and information. Etiquette means the way people behave to show good manners.\n\nToday, many businesses work between different countries. Many business people use English to talk. But the way they talk and what they expect can be different because of culture.\n\nIf you do not understand the culture of business people you work with, you can have problems. You may make unfair judgements or misunderstand each other. This can break communication.\n\nThere are three basic ways business etiquette changes in the world. Knowing them will help you when you work with business people from other cultures.",
    "version": 2,
    "created_at": "2025-08-31 23:11:27.324806",
    "updated_at": "2025-08-31 23:11:27.324807",
    "metrics_meaningbert": null,
    "metrics_cefr_compliance": null
  },
  "feedback": null,
  "attempt_number": 2,
  "best_attempt": {
    "id": "31be1667-a12f-4687-ae73-fa5bd1c12c57",
    "cefr_level": "A2",
    "text_id": "11-a2",
    "text_translated": "Business means when people and companies sell things or services to others. Culture means the ideas, ways, and habits of people from a place or group. Communication means how people share ideas and information with each other. Etiquette is the way people behave to show good manners.\n\nToday, many businesses work between different countries. Many people use English to talk. But the way they talk and what they expect can change with culture.\n\nIf you do not know the culture of your business friends, you can make mistakes. People may not understand each other. This can make problems.\n\nThere are three important ways that business etiquette changes in the world. Knowing these will help you when you work with people from other cultures.",
    "version": 1,
    "created_at": "2025-08-31 23:11:24.489964",
    "updated_at": "2025-08-31 23:11:24.489972",
    "metrics_meaningbert": 0.6114,
    "metrics_cefr_compliance": "A2"
  }
}