{
  "text": {
    "id": "fda03eba-390d-4907-93ff-635e6196af3b",
    "cefr_level": "A2",
    "text_id": "text_001",
    "text_translated": "In the 1990s, graffiti was still popular. (Graffiti is writing or drawings on walls in public places.) Street art also grew very fast around the world. (Street art is art made in public places, like on walls or buildings.)\n\nSome artists made art about how countries are run. They wanted people to think about war. They wanted people to think about when people do not have the same things. They wanted people to think about when people are treated unfairly.\n\nOther street artists wanted to make beautiful art. Their art was nice to look at.\n\nIn South America, many artists went to poor areas. They added colour, life, and things that look nice to grey city walls.",
    "version": 10,
    "created_at": "2025-09-01 17:01:37.611722",
    "updated_at": "2025-09-01 17:01:37.611722",
    "metrics_meaningbert": null,
    "metrics_cefr_compliance": null
  },
  "feedback": {
    "id": "7215540e-98ed-4295-8947-459ab82ec34e",
    "approval": "PASS",
    "grade": 10,
    "feedback": "PASS: All requirements met. The text successfully adheres to the CEFR A2 standard while maintaining factual integrity and meaning. The MeaningBERT score of 0.7866 and BERTScore of 0.9006 confirm excellent fidelity to the original content. The CEFR classifier correctly identified the text as A2. Vocabulary was meticulously simplified; for example, 'explosion' was correctly rephrased as 'grew very fast', 'inequality' as 'when people do not have the same things', and 'discrimination' as 'when people are treated unfairly'. All keywords were defined clearly in A2-level language. Sentence structures are consistently short and simple, using only basic connectors appropriate for A2.",
    "metrics": {
      "cefr_compliance": "A2",
      "bertscore": 0.9006,
      "meaningbert": 0.7866
    },
    "created_at": "2025-09-01 17:01:52.905238"
  },
  "attempt_number": 10,
  "best_attempt": {
    "id": "dbe884ae-5b06-4232-85c7-29600e1b0df5",
    "cefr_level": "A2",
    "text_id": "text_001",
    "text_translated": "In the 1990s, graffiti was still popular. Street art also grew very fast around the world.\n\nSome artists made art to make people think about problems. They showed war, unfairness, and treating people badly. (Unfairness is when things are not fair. Treating people badly is when you are not kind to them because they are different.)\n\nOther street artists wanted to make pretty art. Their art was nice to look at.\n\nIn South America, many artists went to poor areas. They put color on grey city walls. They made the walls look alive and beautiful.",
    "version": 4,
    "created_at": "2025-09-01 16:58:49.614515",
    "updated_at": "2025-09-01 16:58:49.614515",
    "metrics_meaningbert": 0.8118,
    "metrics_cefr_compliance": "A2"
  }
}