{
  "text": {
    "id": "4485137f-5935-49c4-bac5-d2d8d0f5757d",
    "cefr_level": "B1",
    "text_id": "text_001",
    "text_translated": "**Asteroids** are large rocks in space, some of which are considered dangerous because they can pass very close to Earth, within 7.5 million kilometres. NASA has created a map of 1,400 of these asteroids, although they do not expect any of them to be a danger in the next one hundred years. By using special tools to track these objects, NASA can predict if an asteroid might hit Earth. If an impact is likely, they have two different ways to keep the planet safe.",
    "version": 16,
    "created_at": "2025-08-31 21:13:19.839549",
    "updated_at": "2025-08-31 21:13:19.839558",
    "metrics_meaningbert": null,
    "metrics_cefr_compliance": null
  },
  "feedback": {
    "id": "ea9901ba-abce-4ea2-9b09-95e3d4464aa3",
    "approval": "FAIL",
    "grade": 5,
    "feedback": "FAIL: CEFR Compliance. The text was classified as 'B2', which is above the required 'B1' target level. This is likely due to overly complex sentence structures. For example, the sentence 'Asteroids are large rocks in space, some of which are considered dangerous...' uses a relative clause ('some of which') that is more characteristic of a B2 level. Suggestion: To meet the B1 requirement, break this complex sentence into two simpler ones, such as: 'Asteroids are large rocks in space. Some of them are considered dangerous because they can pass very close to Earth.' On a positive note, the text passed all factual integrity and meaning preservation checks, with excellent MeaningBERT (0.86) and BERTScore (0.92) metrics. The definition of the keyword 'Asteroids' was also handled well.",
    "metrics": {
      "cefr_compliance": "B2",
      "bertscore": 0.9162,
      "meaningbert": 0.8608
    },
    "created_at": "2025-08-31 21:13:47.861007"
  },
  "attempt_number": 16,
  "best_attempt": {
    "id": "90405ffd-8cd9-41c5-9aad-5ae460ee591f",
    "cefr_level": "B1",
    "text_id": "05-b1",
    "text_translated": "Potentially Hazardous Asteroids, which are large rocks in space, are considered dangerous because they can pass within 7.5 million kilometres of Earth's orbit. NASA has created a map of 1,400 of these asteroids, but they do not expect any of them to be a threat in the next one hundred years. Using technology that is already available, NASA can track these objects and make predictions about a possible impact. If they predict an asteroid will hit Earth, two different defence solutions could be used to protect the planet.",
    "version": 1,
    "created_at": "2025-08-31 21:02:16.269407",
    "updated_at": "2025-08-31 21:02:16.269415",
    "metrics_meaningbert": 0.9441,
    "metrics_cefr_compliance": "B2"
  }
}