{
  "text": {
    "id": "df5526a3-3e68-41b8-88dd-79b789b4949b",
    "cefr_level": "A2",
    "text_id": "text_001",
    "text_translated": "Genetics is the study of how living things pass their genes.  \nA mutation is a change in a gene.  \nDNA is a long code in our body. It has all the information to make us who we are.  \n\nPeople want to know if genetics affect our brain and language.  \nSome researchers found a gene mutation a long time ago.  \nThis happened between 200,000 and 100,000 years ago.  \nThis mutation helps us speak and control our mouths and face with our brains.  \nMonkeys have a gene like ours, but their gene did not have this mutation.  \n\nIt is too early to say how much genes help us speak.  \nBut one day, we may find the answers in our DNA.",
    "version": 2,
    "created_at": "2025-08-31 23:11:29.626399",
    "updated_at": "2025-08-31 23:11:29.626405",
    "metrics_meaningbert": null,
    "metrics_cefr_compliance": null
  },
  "feedback": null,
  "attempt_number": 2,
  "best_attempt": {
    "id": "634dae8a-caed-4936-9bf9-8adfbc27b9e8",
    "cefr_level": "A2",
    "text_id": "19-a2",
    "text_translated": "Genetics means the study of how living things get their body parts from their parents.  \nA mutation means a change in a gene. Genes are parts inside our body that help decide how we look and grow.  \nDNA is a long code inside our body. It has all the information to make us who we are.\n\nPeople want to know if genetics help us have the ability to speak. Some researchers found a gene change a long time ago. This was between 200,000 and 100,000 years ago. This change may help us speak and control our mouth and face. Monkeys have a gene like ours. But their gene did not change like ours.  \n\nIt is too early to say how much genetics help us with speaking. But one day, we may find the answers in our DNA.",
    "version": 1,
    "created_at": "2025-08-31 23:11:24.447626",
    "updated_at": "2025-08-31 23:11:24.447634",
    "metrics_meaningbert": 0.6588,
    "metrics_cefr_compliance": "A2"
  }
}