{
  "text": {
    "id": "90c1f049-8fd8-4e10-bf25-85ec01b5c8cb",
    "cefr_level": "B1",
    "text_id": "text_001",
    "text_translated": "To find the rest of the middle-sized asteroids, NASA needs money to build NEOCam, which is a 0.5-metre space telescope that would use infrared light to locate them. If they get the money, they could probably achieve their goal in ten years. However, even after the asteroids are located, a special team would still need to work out how to defend the planet from the most dangerous ones.",
    "version": 6,
    "created_at": "2025-09-01 10:50:24.647139",
    "updated_at": "2025-09-01 10:50:24.647149",
    "metrics_meaningbert": null,
    "metrics_cefr_compliance": null
  },
  "feedback": {
    "id": "0f672b60-faa0-474e-89ec-6dfb3e88b625",
    "approval": "FAIL",
    "grade": 4,
    "feedback": "FAIL: CEFR Compliance. The text was classified as 'B2' instead of the required 'B1'. This is because the sentence structures are too complex for the target level. For example, the first sentence, 'To find the rest of the middle-sized asteroids, NASA needs money to build NEOCam, which is a 0.5-metre space telescope that would use infrared light to locate them,' contains multiple clauses and is too long. Suggestion: Break this down into shorter sentences, such as: 'NASA needs money to find the rest of the middle-sized asteroids. They want to build NEOCam, which is a 0.5-metre space telescope. It would use infrared light to locate them.' Despite this structural issue, the factual accuracy, meaning preservation (MeaningBERT 0.86, BERTScore 0.95), and vocabulary simplification were all excellent.",
    "metrics": {
      "cefr_compliance": "B2",
      "bertscore": 0.9496,
      "meaningbert": 0.8581
    },
    "created_at": "2025-09-01 10:50:50.146241"
  },
  "attempt_number": 6,
  "best_attempt": {
    "id": "5b518131-2161-4d81-a284-915dabcb8c8f",
    "cefr_level": "B1",
    "text_id": "46-b1",
    "text_translated": "Whether NASA can find the rest of the middle-sized asteroids depends on getting the money to build NEOCam, which is a 0.5-metre space telescope that would use infrared light to locate them. If they get the money, they could probably achieve their goal in ten years. However, even after the asteroids are found and recorded, the planetary defence team will still need to work out how to defend the planet from the ones that are truly dangerous.",
    "version": 1,
    "created_at": "2025-09-01 10:47:10.850768",
    "updated_at": "2025-09-01 10:47:10.850778",
    "metrics_meaningbert": 0.9357,
    "metrics_cefr_compliance": "B2"
  }
}