{
  "text": {
    "id": "4301b30e-82c8-4927-b0af-14139dde01b6",
    "cefr_level": "A2",
    "text_id": "text_001",
    "text_translated": "The story is about a brave girl. Her name is Katniss Everdeen. She is sixteen years old. Her father died in an accident. He worked in a place under the ground. So, she has to get food for her family. She hunts in the woods around area 12 with her friend Gale. She is very good with a bow and arrow. A bow is a tool. You use it to send arrows far away. Her younger sister, Prim, is chosen to be a 'tribute'. A 'tribute' is a person. This person has to fight for sport. Katniss offers to go instead of her sister. The other 'tribute' from area 12 is a boy named Peeta. Soon, her feelings for him are difficult and hard to understand.",
    "version": 6,
    "created_at": "2025-09-01 10:38:10.578740",
    "updated_at": "2025-09-01 10:38:10.578740",
    "metrics_meaningbert": null,
    "metrics_cefr_compliance": null
  },
  "feedback": {
    "id": "76a2aabd-96d7-4297-926b-2828e5f2bd36",
    "approval": "FAIL",
    "grade": 4,
    "feedback": "FAIL: Meaning Preservation Failure. The MeaningBERT score of 0.6902 is below the required 0.75 threshold. This indicates a failure to preserve the core message of the original text.\n\n- The primary source of meaning loss is the simplification of a key concept. The original text states Katniss has a 'complicated relationship' with Peeta. This implies a two-way, interactive situation. Your version, 'her feelings for him are difficult', reduces this complex interaction to a one-way internal state, which is a significant change in meaning.\n- The simplification of 'mining accident' to 'accident' and 'worked in a place under the ground' also contributes to the loss of specific information, further lowering the meaning preservation score.\n\nSuggestion: Restore the core concept of 'relationship' while maintaining A2 simplicity. Rephrase the final sentence. Example: 'Her relationship with him is not simple. It is difficult to understand.'",
    "metrics": {
      "cefr_compliance": "A2",
      "bertscore": 0.9171,
      "meaningbert": 0.6902
    },
    "created_at": "2025-09-01 10:38:35.169473"
  },
  "attempt_number": 6,
  "best_attempt": {
    "id": "ff715601-aaba-457d-8833-d73e695e1022",
    "cefr_level": "A2",
    "text_id": "text_001",
    "text_translated": "The story is about a brave girl. Her name is Katniss Everdeen. She is sixteen years old. Her father died in an accident in a mine. So, she has to find food for her family. She hunts in the woods around District 12 with her friend Gale. She is very good at shooting arrows. Her younger sister, Prim, is chosen to be a 'tribute'. Katniss offers to go instead of her sister. The other 'tribute' from District 12 is a boy named Peeta. Soon, her relationship with him becomes difficult.",
    "version": 3,
    "created_at": "2025-09-01 10:36:05.177736",
    "updated_at": "2025-09-01 10:36:05.177745",
    "metrics_meaningbert": 0.7597,
    "metrics_cefr_compliance": "A2"
  }
}