{
  "text": {
    "id": "1213ce82-17aa-48b2-9ff2-8513b4c41fd8",
    "cefr_level": "B1",
    "text_id": "text_001",
    "text_translated": "When Wasfia Nazreen was a young girl in her home country of Bangladesh, she saw a hula hoop for the first time when a child from another country was playing with one. She had to stand and watch, but she did not want to, because people there believed that girls should not play with hula hoops or ride bikes. Now, Wasfia is one of the few people in the world who has climbed the Seven Summits, which include mountains like Everest and Kilimanjaro, and she is the first person to have hula-hooped on top of each one. She did this to give women and girls more power and confidence in a country where they are discouraged from doing sports.",
    "version": 16,
    "created_at": "2025-08-31 21:13:58.467508",
    "updated_at": "2025-08-31 21:13:58.467510",
    "metrics_meaningbert": null,
    "metrics_cefr_compliance": null
  },
  "feedback": {
    "id": "2474996c-1bd4-48ac-b910-6917e60f161b",
    "approval": "FAIL",
    "grade": 4,
    "feedback": "FAIL: Meaning Preservation. The MeaningBERT score of 0.6893 is below the required 0.75 threshold, indicating a significant shift in the core message. The primary cause is the simplification of the verb 'to empower' into the phrase 'to give women and girls more power and confidence'. While related, this phrasing dilutes the original's strong concept of enabling self-determination and agency. The original text's focus on empowerment is a key part of its message, and this change was significant enough to be flagged by the metric. To correct this, consider a phrasing that more closely aligns with the original intent, such as 'She did this to help women and girls become stronger and more independent in a country where they are discouraged from doing sports.'",
    "metrics": {
      "cefr_compliance": "B1",
      "bertscore": 0.9499,
      "meaningbert": 0.6893
    },
    "created_at": "2025-08-31 21:14:25.533561"
  },
  "attempt_number": 16,
  "best_attempt": {
    "id": "89e14623-23ef-4a5c-bcfd-2eef2b38e040",
    "cefr_level": "B1",
    "text_id": "text_001",
    "text_translated": "When Wasfia Nazreen was a young girl in her home country of Bangladesh, she saw a hula hoop for the first time when a child from another country was playing with one. She wanted to join in, but she could only stand and watch because people there believed that girls should not play with hula hoops or ride bikes. Now, Wasfia is one of the few people in the world who has climbed the Seven Summits, which include mountains like Everest and Kilimanjaro, and she is the first person to have hula-hooped on top of each one. She did this to help empower women and girls in a country that often discourages them from doing sports.",
    "version": 4,
    "created_at": "2025-08-31 21:05:59.018907",
    "updated_at": "2025-08-31 21:05:59.018912",
    "metrics_meaningbert": 0.7237,
    "metrics_cefr_compliance": "B1"
  }
}