{
  "text": {
    "id": "5ae2ea4f-61f1-48ee-9abe-f10b65cfcd44",
    "cefr_level": "A2",
    "text_id": "text_001",
    "text_translated": "Graffiti is when people write or draw on walls in public places. Street art is art that people make in public places, like on streets.\n\nWhat do people in the art world think about it? Now, many people think it is a real type of art. There were big art shows in Paris, London and Los Angeles. People could see street art in special art places called galleries.\n\nElura Emerald is an American artist. In 2008, she made a street art show in New York. She said good things about street artists. She said they just want to show their ideas. They do not hurt anyone. She said people should like their art.",
    "version": 2,
    "created_at": "2025-09-01 10:30:24.572678",
    "updated_at": "2025-09-01 10:30:24.572679",
    "metrics_meaningbert": null,
    "metrics_cefr_compliance": null
  },
  "feedback": {
    "id": "4db33a6c-f71c-4b52-a193-f465febf7875",
    "approval": "PASS",
    "grade": 10,
    "feedback": "PASS: Exemplary Adherence to A2 Standard. The output meets all requirements of the protocol without deviation.\n\n- Factual Integrity: The simplified text is 100% factually consistent with the original source. All names, locations, dates, and core concepts are accurately represented.\n- Meaning and Fidelity: The metrics are well above the minimum thresholds. A MeaningBERT score of 0.783 and a BERTScore of 0.9058 confirm that the core message and key lexical items have been successfully preserved.\n- CEFR Compliance: The CEFR classifier correctly identified the text as A2, confirming its suitability for the target level.\n- Qualitative Audit: The text is a model of A2 writing. Vocabulary is strictly controlled, using almost exclusively A1 words with one appropriate A2 word ('public'). Sentence structures are short, simple, and direct, avoiding any B1-level complexity. The definitions provided for 'graffiti' and 'street art' are clear and use basic A2 language. The submission is flawless.",
    "metrics": {
      "cefr_compliance": "A2",
      "bertscore": 0.9058,
      "meaningbert": 0.783
    },
    "created_at": "2025-09-01 10:30:45.052672"
  },
  "attempt_number": 2,
  "best_attempt": {
    "id": "82a1e30a-8b74-498c-84b2-985b74887adb",
    "cefr_level": "A2",
    "text_id": "35-a2",
    "text_translated": "Graffiti is when people write or draw on walls in public places. Street art is art that people make in public places, like on streets.\n\nWhat do people in the art world think about it? Now, many people think it is a real type of art. There were big art shows in Paris, London and Los Angeles. People could see street art in special art places called galleries.\n\nElura Emerald is an American artist. In 2008, she made a street art show in New York. She said good things about street artists. She said they just want to show their ideas. They do not hurt anyone. She said people should like their art.",
    "version": 1,
    "created_at": "2025-09-01 10:30:07.159753",
    "updated_at": "2025-09-01 10:30:07.159764",
    "metrics_meaningbert": 0.783,
    "metrics_cefr_compliance": "A2"
  }
}