{
  "text": {
    "id": "d174ea40-8d7d-42ce-ad76-e5b481451db0",
    "cefr_level": "A2",
    "text_id": "text_001",
    "text_translated": "An earthquake is when the ground shakes a lot. Earthquakes break all kinds of things, including bridges. Luckily, it is not common for bridges to fall down. This is especially true for new bridges. Engineers know how to design bridges for places with earthquakes. They build them on ground that does not move easily.",
    "version": 16,
    "created_at": "2025-08-31 21:11:59.043660",
    "updated_at": "2025-08-31 21:11:59.043665",
    "metrics_meaningbert": null,
    "metrics_cefr_compliance": null
  },
  "feedback": {
    "id": "ab5ecb51-546f-415f-b293-bc5026255803",
    "approval": "PASS",
    "grade": 10,
    "feedback": "PASS: Full Compliance. The text meets all A2 requirements.\n- Factual Integrity: The output is factually identical to the original text.\n- Metric Compliance: MeaningBERT (0.7762) and BERTScore (0.9135) are above the required thresholds of 0.75 and 0.90, respectively.\n- CEFR Classification: The text correctly classified as A2.\n- Qualitative Audit: The text demonstrates exemplary A2 standards. The B1 keyword 'earthquake' was correctly identified and defined in simple A2 terms ('when the ground shakes a lot'). All other vocabulary is within the A1/A2 range. Sentence structures are short, simple, and clear, avoiding complex clauses or connectors.",
    "metrics": {
      "cefr_compliance": "A2",
      "bertscore": 0.9135,
      "meaningbert": 0.7762
    },
    "created_at": "2025-08-31 21:12:22.168868"
  },
  "attempt_number": 16,
  "best_attempt": {
    "id": "bdad4ab2-0d03-473b-b5af-c05156d4a866",
    "cefr_level": "A2",
    "text_id": "text_001",
    "text_translated": "An earthquake is when the ground shakes a lot.\nEarthquakes can damage many things, including bridges.\nLuckily, it is not common for bridges to fall down.\nThis is especially true for new bridges.\nEngineers have learned how to design bridges for places with earthquakes.\nThey build them on ground that does not move easily.",
    "version": 2,
    "created_at": "2025-08-31 21:02:32.438911",
    "updated_at": "2025-08-31 21:02:32.438923",
    "metrics_meaningbert": 0.8151,
    "metrics_cefr_compliance": "A2"
  }
}