{
  "text": {
    "id": "97d9d468-9849-4289-a831-ec99f479e491",
    "cefr_level": "A2",
    "text_id": "text_001",
    "text_translated": "A shark is a big fish that can hurt people.\nA lifeboat is a small boat that helps people stay safe.\n\nAt first Pi is scared of animals and jumps into sea.\nHe remembers hungry sharks are near him. So he knows his only option is to climb back into the lifeboat.\nAnimals in the lifeboat kill each other one by one. They also eat each other.\nOnly Pi and the tiger are left.\nHe names the tiger Richard Parker. The tiger is seasick and is not interested in eating Pi now.",
    "version": 9,
    "created_at": "2025-09-01 17:26:23.277904",
    "updated_at": "2025-09-01 17:26:23.278187",
    "metrics_meaningbert": null,
    "metrics_cefr_compliance": null
  },
  "feedback": {
    "id": "7f4e4982-e052-455f-a3a4-35922db9f38a",
    "approval": "PASS",
    "grade": 10,
    "feedback": "PASS: The text is a model example of A2 simplification. It passes all quantitative and qualitative checks without deviation.\n\n- Factual Integrity: All key information from the original text is present and accurate. No facts were altered or omitted.\n- CEFR Compliance: The text correctly registers as A2. The metrics (MeaningBERT 0.82, BERTScore 0.92) confirm high fidelity to the source material, exceeding the minimum requirements.\n- Vocabulary Control: The vocabulary is strictly limited to A1 and A2 levels. No B1+ words were used. The keyword definitions for 'shark' and 'lifeboat' are clear and use A2-level language.\n- Structural Simplicity: Complex sentences from the original text were correctly broken down into short, simple sentences connected only by basic conjunctions like 'and' and 'so'. This meets the required standard perfectly.",
    "metrics": {
      "cefr_compliance": "A2",
      "bertscore": 0.9258,
      "meaningbert": 0.8285
    },
    "created_at": "2025-09-01 17:26:43.406941"
  },
  "attempt_number": 9,
  "best_attempt": {
    "id": "14032d35-a91d-4a88-980f-08fda4a128e0",
    "cefr_level": "A2",
    "text_id": "text_001",
    "text_translated": "A shark is a big fish that can hurt people.  \nA lifeboat is a small boat that helps people stay safe at sea.  \n\nAt first Pi is terrified of the animals.  \nHe jumps into the ocean.  \nHe remembers hungry sharks are around him.  \nHe realises his only option.  \nHe must climb back into the lifeboat.  \nAnimals in the lifeboat kill each other one by one.  \nThey also eat each other.  \nOnly Pi and the tiger are left.  \nPi names the tiger Richard Parker.  \nFortunately the tiger is seasick.  \nThe tiger has no immediate interest in eating Pi.",
    "version": 6,
    "created_at": "2025-09-01 17:24:25.545565",
    "updated_at": "2025-09-01 17:24:25.545566",
    "metrics_meaningbert": 0.8601,
    "metrics_cefr_compliance": "A2"
  }
}